{"data": [{"label": "GIGABYTE GeForce RTX 3070 Ti Eagle OC 8G Graphics Card, WINDFORCE 3X Cooling System, 8GB 256-bit GDDR6X, GV-N307TEAGLE OC-8GD Video Card", "price": "824.00", "description": "NVIDIA Ampere Streaming Multiprocessors 2nd Generation RT Cores 3rd Generation Tensor Cores Powered by GeForce RTX 3070 Ti Integrated with 8GB GDDR6X 256-bit memory interface WINDFORCE 3X Cooling System with alternate spinning fans RGB Fusion 2.0 Protection metal back plate 2x HDMI 2.1, 2x DisplayPort 1.4 Core Clock: 1800 MHz. Get the ultimate gaming performance with AORUS RTX 3070 Ti Graphics Cards. Powered by NVIDIA's 2nd gen RTX architecture and refined with GIGABYTE's WINDFORCE cooling technology, the GeForce RTX 3070 Ti EAGLE OC 8G brings stunning visuals, amazingly fast frame rates, and AI acceleration to games and creative applications with its enhanced RT Cores and Tensor Cores, and superfast G6X memory.", "rating": "4.3", "Reviews": [{"title": "worth the money", "rating": "5", "location-date": "Reviewed in the United States on July 30, 2022", "text": "been using this video card for 6 months. find it well worth the money it middle range video card and can run most rps games. my only complaint it is gets a bit noisy when running at full speed. but all in all very happy with this card."}, {"title": null, "rating": "5", "location-date": "Reviewed in Mexico on January 12, 2022", "text": "Que cumple de acuerdo a la descripción y tiene muy buena calidad en las protecciones de los juegos"}]}, {"label": "Zopsc 8MB 32Bit Desktop Graphics Video Card Graphics Card VGA PCI Computer Accessories Multi Display for ATI Rage X", "price": "20.90", "description": "Feature:\n1. 8MB PCI graphics card supports single machine multiuser and supports multidisplay mode.\n2. Support VOD song system, support for HISHARD / BUDDY / BETWIN software, which supports desktop, server, industrial computer display.\n3. And supports towing machine, while compatibility is very good, PCI with twonotch, also compatible with 64bit PCIX slot.\n4. Graphics card support all motherboards with PCI plugin, which can be easy to install.\n5. The product does not need to install the driver, the system considers itself to be driverfree.\n\nSpecification:\n\n\n\n\nItem Type: Graphics Card\nVideo Memory Capacity: 8MB\nVideo Memory Bit Width: 32Bit\nVideo Memory Type: SDRAM\nInterface Type: PCI, with two-notch design, also compatible with 64-bit PCI-X slots,\nOutput Port: VGA\nMaterial: Metal + printed circuit board \n\n\n\n\n\n\nPackage List:\n1 x Graphics Card", "rating": "3.8", "Reviews": [{"title": "Works fine.", "rating": "4", "location-date": "Reviewed in the United States on March 5, 2022", "text": "Works fine, great bargain."}, {"title": "ok", "rating": "5", "location-date": "Reviewed in the United States on August 29, 2021", "text": "ok"}]}, {"label": "VisionTek Radeon RX 5500 XT Graphic Card - 8GB GDDR6-1.61 GHz Core, 128 bit Bus Width, DisplayPort, HDMI, DVI (901316)", "price": "549.00", "description": "VisionTek RX 5500XT 8GB GDDR6 Graphics Card is one of the newest in the AMD lineup to hit the streets. Annihilate your gaming competition with our compact, powerful and affordable graphics card. Regardless if you game on a monster of a rig or keep things tight with an ITX system, this card performs to keep you gaming at top levels without breaking the bank. The VisionTek 5500XT series provides what every gamer wants in their graphics card: Performance, style and affordability. Warning: Cancer and Reproductive Harm - www.P65Warnings.ca.gov.", "rating": "4.1", "Reviews": [{"title": "This is a good graphics card if on a budget", "rating": "4", "location-date": "Reviewed in the United States on March 7, 2021", "text": "It's a good graphics card but I would recommend getting the eight gig version sometimes it can not run certain games too good because of the 4 gigs that are in if you have extra money in your budget I would recommend getting the eight gig version"}]}, {"label": "VC30, 5V ARGB Graphics Card GPU Brace ,H223mm, Graphics Card Holder for ATX / MATX /ITX , Handscrew Adjust Height with Dual Support, Stronger Magnet Base, Aluminum Magnesium Alloy", "price": "32.29", "description": null, "rating": null}, {"label": "Cavabien 88mm GA92S2U DC12V 0.46A 4pin RTX2080 Ti for ZO-TAC Gaming GeForce RTX 2080 2080Ti AMP Graphics Card Cooling Fan（A Set of Three） (3pcs)", "price": "29.99", "description": null, "rating": "3", "Reviews": [{"title": "Perfect!", "rating": "5", "location-date": "Reviewed in the United States on February 5, 2022", "text": "They work flawlessly like the original ones. I replaced the old ones after they stopped working. I have been using the gtx 2080 zotac for more than 2 years."}, {"title": "Bought 2 fans. Both have constant grinding noises during gaming. Would not recommend to buy.", "rating": "1", "location-date": "Reviewed in the United States on May 28, 2022", "text": "Bought 2 fans. Both have constant grinding noises during gaming. Would not recommend to buy."}]}, {"label": "ASUS TUF Gaming GeForce GTX 1650 Super Overclocked 4GB Edition HDMI DP DVI Gaming Graphics Card (TUF-GTX1650S-O4G-GAMING)", "price": "242.19", "description": "Powered by NVIDIA Turing, the Asus TUF Gaming GeForce GTX 1650 Super delivers legendary durability and performance Featuring auto extreme manufacturing technology. The overclocked 4GB GDDR6 memory deliver over 50% more memory bandwidth for high-speed gaming to match Asus TUF Gaming motherboards and TUF Gaming Alliance products.", "rating": "4.7", "Reviews": [{"title": "Excellent performance for its class, runs toasty however.", "rating": "4", "location-date": "Reviewed in the United States on December 13, 2019", "text": "This low-midrange semi-compact card is a nice little addition to the budget series of graphics cards, especially on Nvidia's side. It outperforms it's competitors and some of the Nvidia vanilla cards without demanding a new power supply, assuming you have a 400W or above already. Unlike the original 1650 and lower models, this requires a 6-pin PCIe connector, which isn't asking much considering it being just a bit above the limit where you wouldn't need one, this card does however run hot, was nearing 80C on Ultra playing Dead By Daylight (thanks again to Asus for the free game back in 2016 from my 950 mini purchase), I did not pay attention to the other settings, just switched to Ultra and started playing, it's not perfect, however, even on ultra I was still getting noticeably better performance than my now broken Zotac 1050 Ti that was struggling on medium, that shows the huge loop in performance just within the next line of cards and having the OC addition of an already upgraded card. Though, Nvidia made their lineup rather confusing and a bit frustrating for some this time around, especially for those who have already chosen the vanilla 1650 which happens to be the same price at the moment, I appreciate their effort into making a card (from all manufacturers) that despite it's inferior specs to some of the competition, can still outperform some of those cards, whether all the time or at some point in a game, depending on the model of course, and without the need to upgrade to more power, sizable form-factors, and even specs, which shows that even that doesn't tell the whole deal on performance. The only real downside about this I can say is it seems a little fragile with what looks to be thinner PCB, shroud, and backplate, and it runs very hot, especially boosted. What I do like about the card is Asus's effort into thinking about other factors in design like dust-resistance and fan bearings. I've had 3 cards fail because the bearings would wear out within a year or two and start grinding without even many hours into the games, or at least many being the \"typical\" gamer average, I'm talking failure within about 5 hours of playing a demanding game after just doing minor graphical tasks on every other instance for the span of 1-2 years. After the card nears 80, it does downclock at some point so that it could get back into the mid-70s without a huge performance loss but temperature is certainly its weak point; the heatsink and overall heat dissipation setup is rather small as well, so that doesn't help. After having 3 cards fail, longevity has been my main concern; these little cards just seem to give out rather early. I'm hoping the new bearings, IP5X dust-resistance, and technology behind the card will help its lifespan, and that the heat won't become an issue for the card itself, performance, and rest of my components. With a 1850+Mhz clock boost, at its size, it's power requirements, and it's performance, this thing is a beast in a compact package, not just with what it can do but the thought behind the specs and technology of the card and its components as well. It's nice to see a company for once make a positive change, and not release the same exact design for a basic card despite the lineup difference. Hopefully other companies can take note and start using something like ball bearings for their fans and take into account little issues vulnerable components can face and put more thought into their cards, however, with this Asus, temperature is the only real concerning problem that I would say maybe they haven't put much thought into as far as that regard, maybe all out performance was their focus, or maybe didn't think it would be an issue? Either way, this is a nice card, I chose this version over the Zotac mainly because of the bearings and tech behind it, also it was only $5 more and is factory OC'd. After 3 bad Zotac experiences, I think my choice was justified.\n\nPros:\n\n*Excellent performance for its class and size.\n\n*Fairly compact single fan design with minor fitting issues I ran into with the backplate needing to budge/be pulled hard and held toward the screw holes to put the screws in.\n\n*Extra thought into the design of some of the most important components\n\n*Does look nice imo with the \"ASUS Geforce GTX\" font on the side while viewing inside the case.\n\nCons:\n\n*Runs hot with small heat dissipation setup and not much that can be done to resolve the issue\n\n*Could have looked a little nicer in terms of aesthetics but with something like this already, that's just nitpicking, though I'm sure it could have been done.\n\n*Packaging might have been missing stuff, or ditched GPU Tweak II CD but it might have been done intentionally on this model. Box is rather barebones once you lift the cardboard holding the card, so I feel it could have been downsized to save on materials.\n\nMix:\n\n*build quality seems just average, or less than what I'd like it to be, just a standard card made to do one job, but feels a little fragile with what seems to be thinner parts and some low-quality feeling materials. Hard to tell its durability and strength. The PCB and backplate seem a little thinner than usual or what I'm used to, and the plastic shroud just feels lightweight/cheap and/or thin of itself, not sure about the actual quality of all the components though. Could just be using not necessarily lower-grade but different materials. Who knows? Could end up being better, at least I hope.\n\nUPDATE: 3/23/21. ASUS, please keep using ball-bearing fans and I'll buy your cards every single time, since no other company seems to think about fan design and longevity, my last 3-4 cards died between 1 and 3 years from fan-failure because the sleeve bearings would go bad and start grinding from drastic temperature changes after playing some demanding games."}, {"title": "Perked up my old Lenovo", "rating": "5", "location-date": "Reviewed in the United States on September 15, 2020", "text": "I purchased this to replace the factory installed GT730 on my Lenovo Ideacentre 710-25ISH I bought from Best Buy six or so years ago. I tried streaming Train Simulator 2020 on Twitch and a friend commented that the capture was laggy. I had noticed that my PC would take a hit on frames in high traffic areas, and could only play on medium detail settings at best. I purchased an EVGA 750 G5 Gold-Series modular power supply at the same time as the 1650 to ensure I had more than enough juice for the new GPU before installation. The GPU was larger than I expected but still left plenty of room in the case. I liked the black with white racing stripes design but as I don't have a clear case it will (hopefully) be a long time before I see it again. The GPU plugged right into the PCI slot and snugged right in to the backing plate once it was secured. This GPU did require me to remove a second backing plate in order for it to fit properly, my old 730 only took up the one. This GPU also requires a 4-pin plug connection from the PSU to power it; it will not receive power solely from the PCI slot. I haven't had enough time in Train Simulator to take actual FPS readings, but can tell you the game now runs at its highest detail settings like butter. Zero lag, very smooth, and the added detail is like night and day. This is a great GPU that offers a budget upgrade without hogging up all the space in a tower and demanding a ton of power."}, {"title": "So far, the best value entry level gaming PLUS streaming.", "rating": "5", "location-date": "Reviewed in the United States on January 26, 2020", "text": "I bought this thinking I might be able to stream 1080p 60fps but BEWARE there will be a LOT of stutters, duplicated frames during the stream/recording. I do either 900p or 720p for smooth streaming and gaming. Make sure to run OBS as administrator. If you're looking to play and stream at the same time and you don't have a lot of money to spend, this card is a go.\n\nHere are my thoughts. I'm pretty sure you've watched reviews on Youtube but here goes anyways. If you haven't, though, you should.\nNoise: The fans only ramp up during streaming and gaming where the GPU has to work extra hard, otherwise, barely audible if you have a completely quiet room. If you have either speakers or normal headphones, you won't be able to hear the noise at all.\n\nPerformance: You really get what you pay for. You can play triple A games at low or medium settings at 1080p 60fps EASILY. This card doesn't even sweat. As long as you don't ask for too much, you'll be satisfied for sure.\n\nThermals: Averages around 70-75 degree Celsius under full load. Peaks at 75 degrees when you play demanding games for hours, it doesn't go above that at all if you don't overclock it. It's already factory overclocked and still has some room for overclocking.\n\nOverall, this card is one of the best, if not THE best entry level graphics card, and you add streaming to that value. You can't really go wrong with this card. It won't disappoint you. You might think it's bad because of the bad reputation that the normal 1650 has, but this card is on another level. For $20 more bucks, you get 40% more performance than the normal GTX 1650, the new NVENC encoding with Turing architecture for streaming, and in this card's case, overclocked, quiet and excellent cooling."}, {"title": "Pretty loud fans, but great budget performance.", "rating": "4", "location-date": "Reviewed in the United States on December 17, 2020", "text": "Please keep in mind I purchased this card at $180. I would recommend against paying for the Winter 2020 price of this card, as the performance is definitely not worth the current price.\n\nI may have got an excellent copy, but this card can sit at 2GHz overclock pretty happily. Many games can run at 1080 60fps at high or ultra, but you do tend to see the limitations of 4GB VRAM. For workstation usage, having the new NVENC encoder is great for working in Premiere, but again more VRAM would be nice. I don't run many AAA titles but expect to run them around medium-high, which for me is definitely acceptable.\n\nIn terms of the actual TUF 1650S, while I did look for a dual fan for better noise, this card is still pretty loud. It gets annoying when you need to restart your computer often. I believe it isn't the actual air moving, but the fans themselves, as running older cards with different fan designs are much quieter. If you care about the noise output, look for a better fan design."}, {"title": "replaced a dead Radeon RX580", "rating": "5", "location-date": "Reviewed in the United States on October 15, 2020", "text": "I had purchased this GPU for a PC build I was working on, however shortly after it arrived an RX580 card went bad on my son's PC. So I ended up dropping this one in and it was a great swap. Both this and the 580 are in the same ballpark in terms of performance but this card basically does just about everything a tiny bit better. So my son tends to play fortnite, destiny 2, Doom, Doom Eternal, and Valorant at 1440p, all run just a little better on the GTX 1650 Super than they did with the RX580.\n\nI have read, and believe that in terms of bang for your buck there is no better card to get than a GTX1650 Super. It's a great CPU to start out with, and you can play all the games you want while you save your pennies for a card that will get you 4k@120Hz.\n\nRecommended, great building block for a gaming PC."}, {"title": "A very good upgrade", "rating": "5", "location-date": "Reviewed in the United States on February 10, 2020", "text": "I have an older Dell Optiplex 990 MT and after going to Windows 10 I found the video card to be lacking. I had enough CPU power, fast memory, a SSD and even upgraded the power supply to a 600 Watt version but the video....\n\nAfter looking at the reviews and seeing what I do, streaming video and photo work, I found this video card to all that and more. The card just fit inside my Dell case and the new PS had the 6 pin power connector for the GPU and I was all set.\n\nIt does not come with drivers so you need to get them off the ASUS site and it's easy to find and install. 15 minutes later I was up and running. The fans are quiet and the dashboard program to adjust the features of the GPU are easy to use and navigate. At ~$160 bucks it a good value. I appreciated the HDMI, Display Port and DVI outputs on the back. I used two of them for my dual display and this card powers both easily."}, {"title": "A solid budget card.", "rating": "5", "location-date": "Reviewed in the United States on February 11, 2020", "text": "The Asus GeForce GTX 1650 Super is a solid budget/ entry level card. It is VERY quiet. I can't here it at all in my tower. It has GDDR6 that is very fast and gives this card it's go juice. It's fairly compact in length but be careful that you have enough space between your pcie slots because this card is wider than a standard double width card. I found out the hard way. It's a decent value if you are playing at 1080p anything higher and you will need more muscle. I REALLY DISLIKE the fact that the card has only 4gb of ram. I feel it should come with six gb of ram. 4gb makes it feel cheap in a bad way. Prices of video cards has gotten really stupidly high over the last few years so I'm kind of soured on both Nvidia and AMD as I feel they are both price gouging customers based on cost vs actual performance of ALL video cards. I hope Intel will be able to compete in a couple of years and drive these prices back down to reasonable levels."}, {"title": "Works, plays games and stuff", "rating": "5", "location-date": "Reviewed in the United States on March 5, 2022", "text": "Expensive for what it is but probably the best value at the time. I suggest waiting till prices come down. I was impatient."}, {"title": "Nice and powerful, but loud!", "rating": "4", "location-date": "Reviewed in the United States on February 19, 2021", "text": "I am very much impressed at the power this graphics card pumped out! Really improved my PC's graphics performance x2 at least!\n\nI purchased when price was only $181.\n\nOnly issue is it gets very noisy when I play ANY* graphics intensive games. Two fans cranking! But frame rate is good otherwise. Oh, and the other issue I had was with the installation, Unless you fit it in there perfect, the fan will hit the plastic housing and make a hellacious noise like it will break the fans blade! Be mindful if you purchase and install yourself!\nGreat budget card otherwise though! I absolutely love it!"}, {"title": "Works great! but...", "rating": "4", "location-date": "Reviewed in the United States on March 14, 2020", "text": "I bought this product a while ago and decided it was about time to make a review on it. This GPU runs great and I've had no problems running AAA games at pretty high quality and still getting above 50fps. Something that sort of threw me off when I first got this is that it's not the same make as the one in the photograph, and on the box. I'm not sure if it makes a difference, but mine only comes with 1 cooling fan, and the product was advertised as having 2. I'm still kind of pissed off by this, however I am not upset by the results this GPU gives me. If I had gotten the GPU I'd expected, this review would certainly be 5 stars."}]}, {"label": "PNY GeForce GTX 1660 Super 4GB XLR8 Gaming Overclocked Edition Single Fan", "price": "21.99", "description": "The GeForce® GTX 1660 SUPER™ is up to 20% faster than the original GTX 1660 and up to 1.5X faster than the previous-generation GTX 1060 6GB. Powered by the award-winning NVIDIA Turing architecture and ultra-fast GDDR6 memory, it’s a supercharger for today’s most popular games. Time to gear up and get SUPER. Now the new GeForce GTX SUPER Series has ultra-fast GDDR6 memory, bringing you performance that’s up to 50% faster than the original GTX 16 Series and up to 2X faster than previous-generation 10 Series GPUs. It’s time to gear up and get SUPER.", "rating": "4.5", "Reviews": [{"title": "Works perfectly in my Dell XPS 8700 after some upgrades", "rating": "5", "location-date": "Reviewed in the United States on June 29, 2020", "text": "I bought a new game (Snowrunner) and found that my older Dell XPS 8700 PC (i7 3.4 Gen-4) was not in the minimum specs for the game.\n\nWith this 1660 Super I needed to upgrade the power supply in my PC to a new 620w version (SeaSonic S12II) that fit perfectly in the case with no modifications needed. I then added two sticks of Corsair memory for a total of 24GB. I then install two 90mm Noctura fans in the case (one on the back and one in the front (no case mod required)). The back fan is connected to power from the power supply and the front fan is controlled by the motherboard. I then took two slot blanks out of the back by the 1660 to move a little more air. My CPU still has the original Intel CPU cooler on it but that will be upgraded eventually. The PC idles at 32c - 37c and games at around 69c - 75c.\n\nNone-the-less the game looks beautiful with the new GTX 1660 Super video card and has so far been completely glitch free. I do not have a 4k monitor so I'm not taxing the card but in HD with a lot of the game video settings maxed it has been doing very well. This should get me another year or two out of this old PC until it's time to build one."}, {"title": "Good budget card for the money", "rating": "5", "location-date": "Reviewed in the United States on September 29, 2020", "text": "Review for PNY GeForce GTX 1660 Super 6GB XLR8 Gaming Overclocked Edition Single Fan:\n\nThis card is great choice for 1080p Gaming. It will play most game titles at 1080p high or ultra settings at or over 60fps. I bought this card to replace my old RX-580 because it died out on me. This card was about a 20-40 percent increase in performance over my old card depending on what game titles were being used. This card is being used with my 144hz monitor and keeps up with it for most game titles. This card has very good low power consumption. Under full load usage the temps for the card stay between 60-70 degrees while gaming for a few hours and it hasn't gone over 70 degrees while gaming as well. If you are looking for a 2k resolution budget card for over 60fps with high or ultra settings, this card can run at 2k decently. It can game at 2k resolution at medium to high settings for 60 fps with graphic settings tweaked in game but this card's sweet spot is definitely for 1080p gaming. The only gripe I have with this card is that it is loud under load. Its not overwhelming loud but but at full load you can here the fan spin up and it is noticeable. Overall I think its a solid choice for 1080p gaming."}, {"title": "It did not come in even a black colored box.", "rating": "2", "location-date": "Reviewed in the United States on September 12, 2022", "text": "I read some of the reviews before I purchased, so I kinda knew it wouldn't come in a wrapped retail box. However, mine came in a white box with just a piece of bubble wrap around it. It didn't even come with PNY logo printed black color box. When I took the video card freshly out of the box, I could see a lot of dusts on the card and also on the fan. I can definitely tell this has been used for sometime. I tested it and luckily it works. I don't know if I need to return it."}, {"title": "Great card, purchased a year ago foR $264. Wouldn't buy at this price.", "rating": "5", "location-date": "Reviewed in the United States on February 16, 2022", "text": "Have had this card for over a year no with no issues what so ever, it does not collect a a lot of dust, then again, I clean my PC monthly. Great small card, would not buy it for $600 right now although.\n\nRuns Apex other games like that comfortably around 90-110 frames. Get around 60-80 for triple A titles like Red dead.\n\nTemps vary from 40c to 70c max that I have seen."}, {"title": "Good card, just loud", "rating": "4", "location-date": "Reviewed in the United States on November 25, 2020", "text": "Good-\nI can run RE2, The Hunter, GTA 5, at 1080p on ultra/very high no issue which is what I was looking for.\n\nIf you want to upgrade from your old card and don’t care about 4k ultra 144hz RTX I think this card is what you’re looking for\n\nForm factor is great. I wanted something small for my micro build and it fits a lot better than I expected\n\nThe bad-\n\nThe only thing that really bothers me is the single fan. You can tell that it is struggling to keep it cool. When it ramps up you’ll definitely know it. Between about 65-70C it gets a little louder and beyond that it sounds like the fan is rubbing or rattling. More effort should’ve really been put in that because it can get annoying."}, {"title": "This is a great card for multiple 1080p monitors!", "rating": "5", "location-date": "Reviewed in the United States on March 16, 2021", "text": "I've had this card for a while now. I've been running it with Linux. The card works great!!!\n\nThis card does not get super hot when running under a heavy load. Stays around 73 degrees Celsius or less. I run a graphically intensive MMO game on 2x 1080p screens with the graphics quality maxed off this card and it works great.\n\nThis card will run 4K, but you probably want a better card if you are gaming in 4K. If you are not running 4K, you probably don't really need a better card than this one!\n\nIf you are wanting to mine digital currency, this is not the right card to get! This card will mine, but you are not going to make much money using this card."}, {"title": "Works great with COD - Warzone. Outputs 4k 60hz for my HTPC", "rating": "5", "location-date": "Reviewed in the United States on May 15, 2020", "text": "Upgrading from a Quadro K2000 to this GTX 1660 Super made a HUGE difference in frame rates, and latency when playing COD-Warzone. I could actually play now, the old card lagged so badly I couldn't play effectively at all.\nGPU response time dropped from 30ms to 3ms, Latency dropped from 170-300ms to 5-25ms over a 300Mbps internet connection.\nUnit is silent unless under heavy load, and then I don't tend to notice, as it's STILL fairly quiet. Even with the two fans on this model.\nUsing it in a Dell Precision T3610 HTPC (685W PS), driving a 4k 60\" TV.\nUsing the HDMI-output with and HDMI 2.0 cable is putting out 4k / 60hz.\nRock solid with latest drivers from nVidia website.\nWish the price was a little less, but it's inline with everybody else. Luckily I had a couple Amazon gift cards to drop the total for me."}, {"title": "No Power Adapter Cable", "rating": "2", "location-date": "Reviewed in the United States on August 16, 2022", "text": "This card needs an 8 pin PCIE express power connection but DOES NOT come with a SATA power adapter cable."}, {"title": "Great little card for overclocking, if you have the case fans to support it.", "rating": "5", "location-date": "Reviewed in the United States on January 15, 2021", "text": "I absolutely love this card, it runs amazing in games. Supporting my 144hz monitor beautifully. I have it paired with an i5 9600k and 16gb of ram. I'm running a fairly decent overclock on the card and I'm seeing performance up there with a GTX 1070 easy. The only thing I notice, obviously, is the card does get warm under long periods of load. Other than that the card if very fast, very good value if purchased for under $300, and I would 100% recommend it to someone looking for a budget card that'll last them a good while."}, {"title": "keeps up with most new games wit settings turned down, BEAST for old-ish games", "rating": "5", "location-date": "Reviewed in the United States on January 29, 2021", "text": "with a little tinkering in msi afturburner you can run games like cyberpunk at 1440p high-ish(most things on high with a few exceptions such as clouds and reflections) but where this shines is playing anything pre2019 at 4k 60 on ultra settings. honestly impressed with this little thing. and its QUIET at full tilt. with afturburner i was able to get an oc of 1995mhz and it would boot to 2010mhz when it really needed to. and the memory will oc to 7950mhz(base :7000mhz oc: +950mhz) and still be stable. great card"}]}, {"label": "Renewed PowerColor Red Devil AMD Radeon RX 6600 XT Gaming Graphics Card with 8GB GDDR6 Memory", "price": "470.97", "description": "Renewed PowerColor Red Devil AMD Radeon RX 6600 XT Gaming Graphics Card with 8GB GDDR6 Memory", "rating": "2.7", "Reviews": [{"title": "doa", "rating": "1", "location-date": "Reviewed in the United States on August 26, 2022", "text": "doa"}, {"title": "i was skeptical", "rating": "5", "location-date": "Reviewed in the United States on September 1, 2022", "text": "card performs exceptionally well! we’ll over it’s rested performance!"}, {"title": null, "rating": "2", "location-date": "Reviewed in Canada on July 25, 2022", "text": "Original card should comes with ARGB cable in the box, while there is nothing besides the card when arrived, should mention that in the description at least. Also, I've did some benchmark and stress testing on the card, seems that the score is within the lower range of typical 6600XT cards, not sure if it is because of 'renewed' or because of the AIB manufacturer. Anyway, without the original warranty, I don't think it is the best option to get this especially longevity is what you are looking for when selecting graphic cards, not to mention that the price of GPU is tanking."}, {"title": null, "rating": "5", "location-date": "Reviewed in Canada on August 5, 2022", "text": "For $290 I received a working 6600xt. This card comes with no manufacturer warranty, no peripherals, simply a box with a packaged card in it. The story of why it is classified as \"renewed\" can mean many things other than the card being new. The price reflects this and should be considered when purchasing. I am satisfied with the purchase and understand the risk involved with a renewed card- albeit you do have 30 day return window with Amazon.\n\nThe 5star is simply because the card works and for the performance it offers at the price I paid. Card was clean too, no scratches or really signs that it was used before."}, {"title": null, "rating": "1", "location-date": "Reviewed in Canada on August 31, 2022", "text": "Received card, slight bit of dust within cooling fins, but nearly brand new looking at it. Installed to replace my RX580, no signal no matter what I tried, LEDs on card lit up, no fan action, no output on any display port. Not sure what testing these get when they are headed out the door but thankful for the Amazon return policy. Not sure if I would take my chance on another one of these to be honest."}]}, {"label": "PNY GeForce GTX 1660 Super 6GB Single Fan Graphics Card (GMX166SN3J6EW1AKTP)", "price": "355.98", "description": "The GeForce GTX 1660 SUPER is up to 20% faster than the original GTX 1660 and up to 1.5X faster than the previous-generation GTX 1060 6GB. Powered by the award-winning NVIDIA Turing architecture and ultra-fast GDDR6 memory, it’s a supercharger for today’s most popular games. Time to gear up and get SUPER. Now the new GeForce GTX SUPER Series has ultra-fast GDDR6 memory, bringing you performance that’s up to 50% faster than the original GTX 16 Series and up to 2X faster than previous-generation 10 Series GPUs. It’s time to gear up and get SUPER.", "rating": "4.2", "Reviews": [{"title": "Far cheaper than other 1660 Super on the market", "rating": "4", "location-date": "Reviewed in the United States on November 1, 2021", "text": "Pros : Low power consuming ( you can have 2 of these in a pc and a 500w psu will work dependent on your CPU ) , low noise ( only 80% fan under heavy gaming ), Cost less than 200$ than other 1660 Super ( got this at 547$)\nCons : Can't dual monitor if you only use HDMI or DisplayPort, no backplate, Lower OC capable than other card due to temp limited from one fan\n8/10 Would buy again"}, {"title": "Too expensive for what it is", "rating": "3", "location-date": "Reviewed in the United States on November 24, 2021", "text": "I know all graphics cards are expensive right now, but man, this one just doesnt even add something extra on the side like nicelooking fans, or RGB. Its like we just jumped back 10 years. if you are looking to spend 600 dollars on a 1660 super, dont do it on this PNY card"}, {"title": "Refunding is terrible.", "rating": "3", "location-date": "Reviewed in the United States on December 13, 2021", "text": "I bought it the product did great but I’ve tried contacting customer service in order to get a refund and I swear on everything they haven’t even emailed me or anything."}, {"title": "Very good", "rating": "5", "location-date": "Reviewed in the United States on October 27, 2021", "text": "Compact size, low noise, very happy"}, {"title": "DOA", "rating": "1", "location-date": "Reviewed in the United States on October 27, 2021", "text": "Usually great card but this was definitely put together cheap and didn't work out of the box."}, {"title": "Someone gave bad intel", "rating": "5", "location-date": "Reviewed in the United States on October 5, 2022", "text": "This graphics card works great! It’s not over clocked and yes we are running dual 27” monitors! One is a HDMI, the other is a display port! 27” curved and straight monitors! It did come with a back plate and was easy to install! 1st gaming pc we built and my 20 yr old son built it basically with very little help!"}, {"title": "Super expensive cost more than a 3060", "rating": "1", "location-date": "Reviewed in the United States on October 19, 2021", "text": "DONT BUY SCAM"}, {"title": "Good GPU but yes it is expensive.", "rating": "4", "location-date": "Reviewed in the United States on November 4, 2021", "text": "This gpu works just fine. Got it sooner than expected! The only downside is the price, it's understandable as all gpu's are expensive. Idk when they will go back to normal prices but the gpu works fine, pricing aside."}]}, {"label": "MEIRIYFA Graphics Card GPU Brace Support, Universal Video Card Sag Holder Bracket, GPU Support Bracket, DIY Adjustable Single or Dual Slot Cards Graphics Stand (Black)", "price": "11.60", "description": "MEIRIYFA Multifunctional video card bracket ,Designed for a wide range of graphics cards and boards.\nUniversal VGA Graphics Card Holder for Computer Cases.\nProtecting the motherboard from being damaged by the weight of graphics card.\nProduct Name: Multifunctional video card bracket\nProduct Size: L95 * W86 * H260mm\nProduct Material: Aviation aluminum alloy\nColor: Black\nProduct Weight: 150g\nSurface Treatment: Anodizing, fine sand blasting\nFeatures:\n1,All-aluminum metal material\nProvides strong and long-lasting support.\n2,Segmented and Slide Design\nThe installation height can be adjusted freely to meet the needs of various user hosts.\n3,Tool-free Design, Easy to Assemble\nTool-less screws are used for fixing the support module.\n4,The base adopts high glossy process.\nThis vertical graphics card holder can support two graphics cards in a multi-GPU setup. Graphics card holder comes with two bars, and you can either use one or two at the same time, depending on the height of the graphics card from the base. This means if you have a smaller case then you are good with one bar only, but if the case is big then you can join the two bars together to extend its length so that it can reach the graphics card.\nPackage list:pillar * 2 + base * 1 + support module * 2", "rating": "4.5", "Reviews": [{"title": null, "rating": "5", "location-date": "Reviewed in Canada on March 15, 2022", "text": "Metal and sturdy, does its job very well, recommend"}]}, {"label": "KAER AMD Radeon RX 550 Graphics Card 4GB GDDR5 128 Bit DirectX 12 PCI Express 3.0 X8 DP HDMI DVI-D Triple Links, 4K Gaming PC Video Cards GPU", "price": "149.99", "description": null, "rating": "4.4", "Reviews": [{"title": "Slow", "rating": "4", "location-date": "Reviewed in the United States on February 26, 2022", "text": "Card was slow not sure on its long term performance as I returned it and got an ASUS card with similar specs but much faster."}, {"title": "Worked as advertised...", "rating": "5", "location-date": "Reviewed in the United States on January 13, 2022", "text": "The daughter's machine was not getting used because she complained of under 30fps on of all games, Roblox... Upgraded with this unit and she is blown away with 6ofps averages..."}]}, {"label": "EVGA GeForce RTX 3090 FTW3 Ultra Hybrid Gaming, 24G-P5-3988-KR, 24GB GDDR6X, ARGB LED, Metal Backplate", "price": "2,407.20", "description": "The EVGA GeForce RTX 3090 is colossally powerful in every way imaginable, giving you a whole new tier of performance at 8K resolution. It's powered by the NVIDIA Ampere architecture, which doubles down on ray tracing and AI performance with enhanced RT Cores, Tensor Cores, and new streaming multiprocessors. Combined with the next generation of design, cooling, and overclocking with EVGA Precision X1, the EVGA GeForce RTX 3090 Series redefines the definition of ultimate performance.", "rating": "5"}, {"label": "NVIDIA Quadro 5000", "price": "269.99", "description": "NVIDIA Quadro 5000 professional graphics board, 2. 5 GB GDDR5 GPU Memory, 352 CUDA Cores, PCI Express 2. 0 x16 system interface, 2x DP 1. 2 connectors, 1x DVI-I DL connector, full height, dual slot, 152 W max power consumption.", "rating": "4.1", "Reviews": [{"title": "a bit dodgy", "rating": "2", "location-date": "Reviewed in the United States on December 17, 2021", "text": "on first startup the fan rubs on the surrounding shroud, takes surrounding shroud off... ok fixed.\n\neven though it has 2x DP 1. 2 connectors you can only really use one at a time.\n\nyes it supports up to 2560x1600 on 2x screens thru the DP chaining feature but that is really the monitor just passing thru the signal. so if you think you can just run 2x DP cables one to each in a pair of monitors your not going to get an extended desktop.\n\nyou can however run one DP cable and one DVI cable and get an extended desktop on 2x screens @ 2560x1600\n\nit maybe possible to run 2x DP cables and get an extended desktop but finding support for this card is impossible. there might have been special drivers at one time but that seems to be lost in the mists of the past.\n\nall in all... it's a marginally ok experience. Resolve does run ok'ish just pretty slow but this was not a surprise. Unless you have a very specific use case don't waste your money on this card, I did... thinking I was going to get maybe a useable setup."}, {"title": "Didn't come with everything in the description.", "rating": "3", "location-date": "Reviewed in the United States on July 2, 2021", "text": "GPU came by itself with no other adapters that were said to come with it in the description. GPU was slightly bent so I had to bend it back to fit in my case. Otherwise it works well."}, {"title": "responses to questions in short time", "rating": "5", "location-date": "Reviewed in the United States on September 27, 2021", "text": "resolves questions quickly"}, {"title": "Excellent customer service", "rating": "5", "location-date": "Reviewed in the United States on January 24, 2011", "text": "The car is what you could expect from the Quadro range, an excellent piece of hardware with very good performances with professional applications. If you are only after casual 3D modeling or for gaming, it is better (less expensive) to look for a GTX 580, however for professional use this is an outstanding product.\n\nI also give 5 star because of the Amazon service : it happened to me that a wrong board was sent the first time : I was obviously disappointed and sent a claim to Amazon. To my amazement, in less than 24 hours they acknowledged it and sent over a new board (on December 24th) without asking a single question. I can honestly say I never experienced an aftersales service like this."}, {"title": "Replacement for HP Z800 workstation original NVIDIA Quadro 5000 card for video editing", "rating": "5", "location-date": "Reviewed in the United States on November 18, 2017", "text": "I bought a refurbished HP Z800 for the primary purpose of video editing using Adobe Premier CC. 48 GB DDR3 2x Intel Xeon Six Core E5645 2.4 GHz. My (original) NVIDIA Quadro 5000 video card failed after a couple of years. Bought two of these identical replacement cards (they work together) to increase video file rendering and exporting efficiency. Enables the use of Adobe Mercury Playback Engine GPU Acceleration (CUDA). Noticeable difference in performance using two. Easy installation on the modular Z800."}, {"title": "Problematic", "rating": "3", "location-date": "Reviewed in the United States on February 21, 2012", "text": "I got this item for a workstation. However it overheated and crashed the machine in the initials.\nI sent it back to PNY which I must say had very good customer service.\nHowever when I received the replacement it did not operate AutoCAD with the performance I got from a generic 3d fx gaming card.\n\nFrom what i gathered it was due to the shear size of our drawing and data on it that it operated rather laggy as it tried to regenerate the drawing accurately for any zoom, pan or rotation.\nWe eventually went back to the original gaming graphics card which operated much more smoothly."}, {"title": "Great Video Card", "rating": "5", "location-date": "Reviewed in the United States on February 8, 2017", "text": "I recently replaced another brand video card, which was recommended by a college professor, and the difference is amassing.\nUsing all the same components that I was using with the other brand video card, I can now see individual hairs and count blades\nof grass!"}, {"title": "NVIDIA Quadro 5000 by PNY 2GB GDDR5", "rating": "3", "location-date": "Reviewed in the United States on January 5, 2012", "text": "Nice looking unit, but it does not do $1,700 worth of work. I think a $700 Nvidia Graphics card would do just a good, as far as anybody could actually detect while rendering, or working in architectural design software. If you are doing video editing, an Nvidia GPU is a must, but try one of the less expensive models."}, {"title": "product arrive in good condition exactly as advertised.", "rating": "5", "location-date": "Reviewed in the United States on August 30, 2019", "text": "product arrive in good condition exactly as advertised."}, {"title": "Three Stars", "rating": "3", "location-date": "Reviewed in the United States on February 21, 2016", "text": "Working but overheated at times"}]}, {"label": "SAPLOS NVIDIA GT 730 4GB DDR3 128-bit, Low Profile Graphics Card, HDMI, DVI, VGA, PC Video Card, Computer GPU for Working, Low Power, PCI Express x16, 2K Support, Fermi, DirectX 11", "price": "89.99", "description": null, "rating": "4.4", "Reviews": [{"title": "Decent Value!", "rating": "5", "location-date": "Reviewed in the United States on September 21, 2022", "text": "This turned my cheap PC into a gaming box."}, {"title": "Works as described to run a second monitor", "rating": "5", "location-date": "Reviewed in the United States on August 26, 2022", "text": "Works as described to run a second monitor"}, {"title": "Muy buena", "rating": "5", "location-date": "Reviewed in the United States on August 24, 2022", "text": "Buena"}, {"title": "Good product and campatiable with windows 11", "rating": "5", "location-date": "Reviewed in the United States on June 28, 2022", "text": "good price and good product"}, {"title": "Easy installation. Worked out of the box.", "rating": "5", "location-date": "Reviewed in the United States on May 18, 2022", "text": "Good, inexpensive low-profile video card. Works great."}, {"title": "Good inexpensive graphics card", "rating": "5", "location-date": "Reviewed in the United States on April 19, 2022", "text": "This dropped into my Solaris OS system very well and is driving two 1600x1200 monitors."}, {"title": "Item was not supported by my PC", "rating": "3", "location-date": "Reviewed in the United States on December 16, 2021", "text": "My PC, HP 6300, did not accept the card. Item was returned. Return was easy. Item was as described. My PC was just too old. If I had researched this more thoroughly, I would have found that my motherboard was not suitable. Iten and seller were five stars, my computer zero stars, and so I split it to a 3-star rating."}, {"title": "Lo anunciado como low profile pero no trae los adaptadores", "rating": "5", "location-date": "Reviewed in the United States on November 12, 2021", "text": "Lo anunciado como low profile pero no trae los adaptadores"}, {"title": "Bare-bones card that works, with the right BIOS settings", "rating": "4", "location-date": "Reviewed in the United States on February 1, 2022", "text": "Had trouble getting this work on an MSI B550-A Pro motherboard. Toggled around some of the settings until I noticed that you can set the CPU PCIe Gen to 2,3 or 4. I set it to 2 and this card now works. The caveat is that you need a more modern card installed first to be able to change those settings. The Ryzen CPU model I got requires discrete graphics."}, {"title": "Exelente estado para ser de 2da mano...", "rating": "5", "location-date": "Reviewed in the United States on July 14, 2022", "text": "La compra no fue un desperdicio...\nPara ser una gráfica de 2da mano, llegó en exelente estado, y asta el momento no me ah dado ningún problema...\nCumplió, y cumple con mis propósitos."}]}, {"label": "KAER GT 730 Graphics Card, 4GB DDR3, DirectX 11 128 Bit, VGA/DVI-D/HDMI, PCI Express 2.0 x 16, Nvidia Video Card, Computer GPU", "price": "89.99", "description": null, "rating": "3.7", "Reviews": [{"title": "Arrived on time pkg well and works great. Thank you", "rating": "5", "location-date": "Reviewed in the United States on September 13, 2022", "text": "I am so glad the correct product was sent with no problems . No worries about quality or function because this part was well pkg...thank you."}, {"title": "Good deal for the money", "rating": "4", "location-date": "Reviewed in the United States on June 5, 2022", "text": "The low profile mounting bracket did not come with the product as advertised."}, {"title": "CONSUMIDORA DE ENERGIA", "rating": "3", "location-date": "Reviewed in the United States on February 22, 2022", "text": "Compre la tarjeta por que decía que no consumía energía adicional, no la he podido ni conectar por que no hay suficiente energía en mi Pc para alimentarla, la hemos conectado en la Board con el cable que compre adaptador y no le dio energía, entonces la adaptamos al conector de wifi y quemó el fusible, no sabemos que mas hacer, no la he podido probar ni siquiera para saber si es siquiera tan buena como dice la reseña, pero hasta ahora imposible ponerla a andar.\nOjla y reciba un consejo de que hacer con ella para ponerla a funcionar."}, {"title": "Worked", "rating": "5", "location-date": "Reviewed in the United States on June 23, 2022", "text": "I didn't leave any stars on gaming cause I haven't tried it yet. The instructions were little hard to follow on setting up the drivers but finally got them."}, {"title": "Easy installation of KAER Nvidia GT1030 graphics board", "rating": "4", "location-date": "Reviewed in the United States on December 1, 2021", "text": "The card works fine with my PC, Core I7-4790 3.6 GHz. Replacing the existing long bracket with short one, made by Adecco, was easy."}, {"title": "Replacement", "rating": "5", "location-date": "Reviewed in the United States on July 24, 2022", "text": "Upgrade needed for new game"}, {"title": "Excellent video card for 4k video", "rating": "5", "location-date": "Reviewed in the United States on December 1, 2021", "text": "Needed to upgrade my computer for my 4k TV. Old card would not play 4k hevc content at 60 hz. Looks very high quality and all benchmarks are above expected for a Gt 1030. If you get a gt1030 avoid the ddr4 version, as it is less than half the speed of the ddr5 version. Very happy with my purchase!"}, {"title": "Exelente Precio!", "rating": "5", "location-date": "Reviewed in the United States on June 12, 2022", "text": "Trabaja muy bien!"}, {"title": "Very cheaply made. Less then 9 months use and it trash", "rating": "1", "location-date": "Reviewed in the United States on July 22, 2022", "text": "Very poorly made. This is a very low end graphics card. Never been able to update the drivers as its out of date. I use alot of different products as I stream on a few platforms and I try to use budget friendly items to review them for other streamers who are tied to a budget. If you are getting this card for a purpose other then to achieve dual or multiple screens this isnt for you. I have used it for roughly 8 months and its completely dead. I only ever used it to stream games twice and it couldn't handle it unless I was on all low settings'."}, {"title": "Perfect for gaming", "rating": "5", "location-date": "Reviewed in the United States on January 5, 2022", "text": "well i thought it would of messed up my computer but now i know how to installed it by myself without a Technion to install it for me..... *Thumbs Up*"}]}, {"label": "PNY GeForce GT 1030 2GB Graphic Card (GMG103WN3H2CX1AKTP) (Renewed)", "price": ".", "description": "PNY GeForce GT 1030 2GB Graphic Card (GMG103WN3H2CX1AKTP) (Renewed)", "rating": null}, {"label": "Gigabyte NVIDIA GeForce GT 1030 2GB GDDR4 Graphics Card", "price": "88.15", "description": "Manufacturer N1030D4 2GL (Manufacturer N1030D4 2GL) ASIN: B07CQ6Q52H", "rating": "4.4", "Reviews": [{"title": null, "rating": "5", "location-date": "Reviewed in Italy on March 17, 2022", "text": "Comprata in piena crisi di chip e pagata all'incirca 110 euro. Non è una scheda di alto livello, ma per chi come me l'ha presa per avere una workstation stabile e per un gaming leggero, allora è più che perfetta. La scheda è silenziosa e viene fornita anche insieme al CD di installazione dei driver, anche se non sono aggiornati, e anche con la staffa low profilo per chi avesse un case piccolo."}, {"title": null, "rating": "4", "location-date": "Reviewed in Italy on November 25, 2021", "text": "Avevo da potenziare un 'pito' un pc con una cpu un po' debole e questa scheda ha trasformato il pc in qualcosa (non certo scattante o potente) ma tranquillamente usabile. Si può anche giocare a Battlefield V (ovvio anche qui. con dettagli low). Contento dell'acquisto."}, {"title": null, "rating": "5", "location-date": "Reviewed in Italy on February 17, 2022", "text": "Ho comprato questa scheda per il mio vecchio pc fisso e devo dire che funziona alla grande!\nL’unico dubbio che ho avuto ricevendo il pacco è: perché non c’era il sigillo di sicurezza sulla confezione?”\nNon capisco se la scheda sia ricondizionata, usata, o se la pellicola di sicurezza sia stata rimossa per altre ragioni.\nPer il resto, davvero ottima! Arrivata in un paio di giorni dall’ordine."}, {"title": null, "rating": "4", "location-date": "Reviewed in Spain on October 30, 2021", "text": "La verdad bastante bien no para pedir más de lo que es pero cumple su función videos 4k sin problemas y juego por ponerte un ejemplo Fallout 4 gráficos medios va fluido"}, {"title": null, "rating": "5", "location-date": "Reviewed in Italy on September 28, 2021", "text": "Presa per sostituire una gtx 750 oem a cui non andava più la ventola, con l'occasione ho preso questa per avere una scheda un po' più recente che va decisamente molto bene; low profile come la precedente, consumi bassi e silenziosa. Purtroppo per vedere Netflix in 4K è necessaria una 1050, ho provato a cercarla ma troppo over price circa 300 euro per una scheda comunque datata... la 1030 sui 100 euro si conferma un best buy per pc silenziosi, fa girare bene qualche gioco senza pretese e programmi di grafica base, peccato non sia compatibile con netflix in 4K il che non la rende ideale per un pc da salotto"}, {"title": null, "rating": "5", "location-date": "Reviewed in Spain on November 26, 2021", "text": "Con el precio que tiene no me esperaba que fuera a acelerar demasiado el procesado de vídeo de mi PC. Hago vídeos para YouTube y buscaba algo para acelerar el renderizado de los mismos. Fue ponerlo y el tiempo se ha reducido a la mitad. No es una tarjeta \"puntera\", pero desde luego cumple muy bien con su función."}, {"title": null, "rating": "5", "location-date": "Reviewed in the United Kingdom on October 31, 2021", "text": "DDR4 is the only thing that lets this down wish i had gone for a DDR5 version but i didn't have DDR5 money but it worked a treat. I made my computer in 2013 >it was the Beeze Knees then even an a Gigabite GTX670 windforce card in it which was DDR5. but this card is actually better go figure."}, {"title": null, "rating": "4", "location-date": "Reviewed in the United Kingdom on August 5, 2021", "text": "Easy install and simple upgrade to add new life to a pc"}, {"title": null, "rating": "4", "location-date": "Reviewed in India on June 29, 2021", "text": "Good for 720p gaming"}, {"title": null, "rating": "5", "location-date": "Reviewed in India on June 27, 2021", "text": "Value for money and gaming level at optimal 720p gives about 120 fps in gpu demanding game . If you just want a card that can give you better gaming experience at value for money then this is must buy"}]}, {"label": "EVGA GeForce GTX 1660 Black Gaming, 6GB GDDR5, Single Fan 06G-P4-1160-KR", "price": "239.00", "description": "The EVGA GeForce GTX 16-series graphics cards are powered by the all-new NVIDIA Turing architecture to give you incredible new levels of gaming realism, speed, power efficiency, and immersion. With the EVGA GeForce GTX 16-series gaming cards you get the best gaming experience with next generation graphics performance, ice cold cooling, and advanced overclocking features with the al new EVGA Precision x1 software.", "rating": "4.6", "Reviews": [{"title": "Works fine on Dell XPS 8500 Win 10 for Blender use and general work, but with a bug ...", "rating": "4", "location-date": "Reviewed in the United States on February 18, 2021", "text": "Hi,\nI am not a gamer, but I am a budding amateur graphics artist. So this was for improving my desktop computer. It does improve rendering and things generally work well, but there is a bug. The audio on board the Dell computer no longer works. It works on the two HDMI connected monitors and bluetooth. I can run the headsets to the 3.5 mm jack on the monitors, but not the jack on the computer that I was using with the factory video card."}, {"title": "Fine gpu but wouldn’t pay higher than the msrp", "rating": "4", "location-date": "Reviewed in the United States on March 6, 2021", "text": "Great gpu I’m glad I bought it soon because a day after the price spikes up $100 but good gpu would perfect a different version but only one I could find and. I would like a zero rpm mode for better noise levels"}, {"title": "purchased before gpu scalping", "rating": "5", "location-date": "Reviewed in the United States on July 18, 2021", "text": "should have bought better gpu at the time but hindsight is 20/20. This one was a huge upgrade from my GTX 550TI though."}, {"title": "You'll be disappointed", "rating": "3", "location-date": "Reviewed in the United States on June 17, 2021", "text": "But only in gaming! Lol...it'll keep up with assassins creed valhalla but it'll dip slightly in some areas of the game! It's an OK card! Doubt it'll run cyberpunk with medium settings! Good luck!! Not good with more than 1 monitor though, it'll run em..."}, {"title": "This is great graphics card for a 6 pin power supply", "rating": "5", "location-date": "Reviewed in the United States on May 5, 2020", "text": "Games like rocket league hit over 200 fps at 1080p paired with my processor and overall system. This card takes a 6 pin power cable and fits in my smaller gaming system. The thing is a beast especially for the price. Other more graphical games i am hitting 144 fps. This card took my system to the next level for the price."}, {"title": "Excelente inversión", "rating": "4", "location-date": "Reviewed in the United States on June 10, 2020", "text": "Quise compararla con otras y es como tener una 1060, casi a su nivel solo por poco, pero es una muy buena inversión comprar una 1660"}, {"title": "Needed a upgrade", "rating": "5", "location-date": "Reviewed in the United States on July 12, 2021", "text": "Perfect upgrade with out breaking the bank"}, {"title": "Low oc potential", "rating": "4", "location-date": "Reviewed in the United States on November 17, 2020", "text": "It’s decent Howe you can’t increase power limit for overclocking."}, {"title": "Super Nice Card For The Money", "rating": "5", "location-date": "Reviewed in the United States on November 23, 2020", "text": "Super Nice Card For The Money. Not the latest and greatest, but a really nice card that gets the job done with ease."}, {"title": "Works amazing", "rating": "5", "location-date": "Reviewed in the United States on May 26, 2021", "text": "Works like a beast"}]}, {"label": "Graphics Card GPU Brace Support Video Card Sag Holder/Holster Bracket, Anodized Aerospace Aluminum, Single Slot Cards Support，Safe Without Magnet（Black）", "price": "9.99", "description": "LASTING PROTECTING GPU CARD: this GPU support bracket is specially designed to protect and support the graphics card/GPU cards, prevent the graphics card from sinking and bending, which is great damage to your valuable graphics card. Especially for some customers who has systems sensitive to the electromagnetic environment, that is why we designed this GPU support without any megnet. and if you wanna the one with magnet, please kindly search \"glotrends\" for more options.", "rating": "4.1", "Reviews": [{"title": "Just works.", "rating": "5", "location-date": "Reviewed in the United States on September 6, 2022", "text": "For less than $10 you can't go wrong. Have had this in my system for about a year. Got a Chungus of GPU(EVGA 3080tiFTW) and had never experienced GPU sag. Needed something fast and cheap and this fit the bill. It has a nice anthracite powder coating, I believe you can get it in other colors, but this one fit my build the best. I actually positioned mine as close to my motherboard as I could, and almost between the GPU and mobo and you can only see it if your right up at the glass. It still looked decent when positioned directly in the middle of the card, but it got in the way of my tubing."}, {"title": "Simple and it works as others have said", "rating": "3", "location-date": "Reviewed in the United States on September 1, 2021", "text": "To long for my need now that I got it, but price is right. I will just saw it down to the right size (and fit a black rubber cap to the top to support the end of the GPU). Need only about a 2-1/3\" lift from the case floor to the GPU to support the GPU - it's a RX6700XT, and d*mn near 12-1/2 inches+ long, and MOST brackets are too short (ones that are horizontal from the rear case GPU mount screws), and this, and similar (vertical supports) are generally far to high. I thought this one had two sections that screwed in and little screwed top piece, and I was only going to use one of the 2 sections, but I think I just selected the wrong one when I was looking for the (about)$10 price ones - which is all these should cost at most ! It'll work. Picture of inside of my Lian Li Snow Mini with the Power Color RT 6700 XT at the bottom and now being supported by this bracket and about 4 inches of the support rod above the top of the GPU. Plan to just hacksaw it off, and repaint or put a cap or something on the top. All red as yo can see with thew RGB thinggies."}, {"title": "Works in a pinch", "rating": "4", "location-date": "Reviewed in the United States on June 23, 2021", "text": "It works as intended however a bit difficult to use with odd ball cases and configurations. If you're using a standard case you should have no issues."}, {"title": "The locking screw to hold the video card up doesnt even lock", "rating": "1", "location-date": "Reviewed in the United States on December 17, 2021", "text": "Strangest thing ever, the screw that screws into the pole to lock the holding plate that fits under the video card to hold it in place. Has a stopped on it that you screw it in its exactly flush with the inside of the pole so it doesnt even reach the pole and im wondering how youre supposed to lock it in place. If you put pressure on it where the plate is at an angle it sort of locks and wont slide but it still is a very strange design decision to make it this way. I know it was a conscious decision to make it this way though because theres a circular disc around it to keep the screw from going any further. But WHY???? So weird. I plan to get another screw to go into it so i can lock the plate in place, otherwise the pole and base are sturdy as well as the plate. Just the locking screw is just more like a handle on the outside of the plate than something that actually locks it. Really weird. So thats why i gave it such a low reveiw score its kind of useless since you cant lock it really. Weird...."}, {"title": "This is TINY", "rating": "1", "location-date": "Reviewed in the United States on October 5, 2022", "text": "Another case of deception through perspective. The picture makes it look like it will support the video card but in reality, it is so small, it simply can't. Less that half the distance from the base to the card. My advice? HARD PASS"}, {"title": "Product great, shipment wierd.", "rating": "3", "location-date": "Reviewed in the United States on June 28, 2021", "text": "I received my item and it comes in a box. Well the pole was just thrown in the bag and not even in the box even though there is a spot in the box. It looked like it was used before and they just didn’t care enough to put it all back in the box correctly. Otherwise product is good."}, {"title": "This brace is fantastic", "rating": "5", "location-date": "Reviewed in the United States on July 23, 2021", "text": "Brace is made from high quality materials. Very adjustable so should fit almost any case. Supports weight of the card so no stress on the motherboard."}, {"title": "Better then all the styles out there for for gpu sagging", "rating": "5", "location-date": "Reviewed in the United States on July 26, 2021", "text": "It's good works as it should build quality is also good. Can hold up my 6800xt red devil no problem"}, {"title": "Simple and it works", "rating": "5", "location-date": "Reviewed in the United States on May 24, 2021", "text": "It's simple, sturdy, and it works. Not much to it. Buy it if you need it, don't buy it if you don't need it."}, {"title": "Artículo incompleto", "rating": "1", "location-date": "Reviewed in the United States on July 17, 2022", "text": "La caja dentro del paquete venia abierta y el contenido de la caja venia incompleto"}]}, {"label": "GPU Support Bracket Graphics Card GPU Brace Video Card Sag Holder/Holster Bracket for Single or Dual GPU Cards Video Card Sag Holder/Holster Bracket Adjustable Length and Height (Silver)", "price": "11.99", "description": null, "rating": "4.1", "Reviews": [{"title": "It Works", "rating": "4", "location-date": "Reviewed in the United States on February 7, 2022", "text": "Be sure to order the correct material that you want. I wanted an all black one but ended up with a chrome version. It comes with a small allen wrench that can be a bit hard to use in confined spaces. It is small. The materials used in this seem to me to feel solid. While the rounded base does limit the device placement in some cases, such as this 5000D in the image, it can and does work. It will just take you a bit of effort to correctly place and then lock down the support. It is not a pretty thing to have in your system, but it works. And what is better, a sagging graphics card, or a somewhat ungainly support?"}, {"title": "Works great!", "rating": "5", "location-date": "Reviewed in the United States on June 19, 2022", "text": "Does the job perfectly. No issues so far after a couple months."}, {"title": "Remove the rubber & magnet from base, tighten screw with phillips-head screwdriver!", "rating": "3", "location-date": "Reviewed in the United States on December 30, 2021", "text": "I've seen people complain it came loose from the factory, just remove the rubber on the bottom only on with glue, and pop the magnet out, and tighten the screw. Well worth the $6/$7 bucks paid. Knocked 2 stars off for the poor QC."}, {"title": "It does what it's supposed to", "rating": "5", "location-date": "Reviewed in the United States on November 19, 2021", "text": "Holds up the GPU. Doesn't appear to have any issues with how the arm mounts. Holds firm. Great, especially for the price."}, {"title": "Great product.", "rating": "5", "location-date": "Reviewed in the United States on October 4, 2021", "text": "There is a magnet in the base so if you put it too close to a corsair fan the fan wont spin. Other than that great product."}, {"title": "Piece of crap", "rating": "1", "location-date": "Reviewed in the United States on May 23, 2022", "text": "Do not waste your money. Piece I received was used, or just junk. Upright piece just flops around. Clamp is cross threaded. Real piece of crap."}, {"title": "Ordered white.....", "rating": "1", "location-date": "Reviewed in the United States on May 21, 2021", "text": "So nothing wrong with the product itself...but come on its..freaking silver..bling bling silver..not white. I'll just use it in another system, and not buy from them again."}, {"title": "Comes in broken and it’s silver not white", "rating": "1", "location-date": "Reviewed in the United States on August 15, 2021", "text": "The long metal piece came in broken and wobbly and worn even support my gpu"}, {"title": "It Works", "rating": "5", "location-date": "Reviewed in the United States on August 29, 2022", "text": "It works really great, actually. Just what I needed for my Red Devil AMD Radeon RX 6700 XT graphics card to sit in the case without it leaning. When I opened the package I was skeptical, but I haven't had any issues since I put it in last year."}]}, {"label": "XFX RX 5700 XT Raw II 8GB GDDR6 1905MHz 3xDP HDMI PCI Express 4.0 Graphics Card RX-57XT8OFF6", "price": "329.00", "description": "Bend the rules great gaming experiences are created by bending the rules. The AMD Radeon RX 5700 Series GPUs are powered by the all new RDNA architecture and are designed from the ground up for exceptional 1440P performance, exceptional power-efficiency for high-fidelity gaming. Equipped with the latest 8GB of GDDR6 high-speed memory and PCI Express 4.0 support, delivering twice the bandwidth. Specifications: Bus type: PCI-E 4.0, base clock: 1605MHz, game clock: 1755MHz, boost clock: Up to 1905MHz, stream processors: 2560, memory bus: 256 bit, memory clock: 14 Gbps, memory size: 8 GB, memory type: GDDR6, card profile: 2.9 slot, thermal solution: DD Fansink. Features - Display Port ready DisplayPort 1.4 HDR, HDMI ready 2.0b.", "rating": "4.4", "Reviews": [{"title": "Great Card, Terrible Drivers", "rating": "4", "location-date": "Reviewed in the United States on March 18, 2020", "text": "AMD has really hit a great sweet spot here with the 5XXX line of cards, specifically the 5700XT. This card benchmarks similar or better performance than a nVidia 2070 Super, at a much lower price! That's always been AMD's A game, best bang for the buck, and they've hit that spot again.\n\nNow specifically about this card. I was leary about spending less on a card when the \"bigger name\" brands are $30-$100 more, but I've had XFX cards in the past and they've worked just fine, so I gave this one a shot.\n\nOut of the box, this card was MUCH larger than I expected. I had to move around SATA ports just to get it to fit. I expected it to be around the size of my RX480, but I way underestimated that! So know going in you need to make sure your motherboard layout isn't going to be effected by this card's size. It's much wider and longer than any previous AMD card I've seen.\n\nNow, as for the performance. On boot, everything seemed great. I've always had problems with AMD's drivers, they're notorious for having buggy, crashing driver releases. I've always had multiple system crashes when doing clean installs of AMD's graphics drivers in the past. But doing a complete clean driver install worked flawlessly, no crashes on the driver install. Huge pleasant surprise!\n\nThen I tried playing some games to start testing the performance. That's where I started to run into serious problems. Every game I tried to play, my computer would hard lock. The GPU driver was crashing. Obviously that's incredibly frustrating for a brand new high end graphics card. I tried changing game settings, both in regular gaming and VR, and nothing changed. Drivers would crash every time after getting into the game (though the menus would load fine).\nBefore considering an RMA, I looked into the issue to see how many others were having these problems, and it appears to be a very large number of people. After a couple of hours of digging, I discovered the issue was because the graphics card is overlooked out of the box WAY over stock, and even higher than the highest advertised overclocked cards. This is why it was crashing. This is a serious oversight from a firmware/driver standpoint. The default settings should never be overclocked. The main problem comes from the voltage is set at 1.2mV by default, and the card can't handle that much voltage. You have to undervolt the card, in my case to 0.99mV in order to get the card to run on stock settings.\nThat in itself is a simple enough fix, except that you can't force the card to actually run at those settings by default, you have to use software to change those settings on system startup. And that's where another issue came up. AMD's software for overclocking (or in this case underclocking) their hardware, Wattman, would not save these new settings on startup no matter what I tried. Every boot, even with the software running on startup and the profile saved as default, the card would start with the original default settings. This would be incredibly frustrating to have to manually change the graphics settings on every reboot/crash.\nSo rather than use AMD's software, I had to resort to using other software to manage the settings. In this case MSI AfterBurner. MSI's software has worked flawlessly for years, but it does have issues with compatibility with VR (specifically Oculus), so do keep that in mind if you do a lot of VR gaming.\nThe next issue that I ran into is that apparently AMD's FreeSync does NOT work with this card, at least on the current drivers. So that also had to be disabled, which is incredibly disappointing, but would certainly have to be fixed at some point. So I'm waiting for further driver updates to hopefully be able to turn that back on.\n\nAfter finally getting all of that sorted out, it was finally time to test some games! This thing is an absolute beast for gaming. A massive upgrade from my RX480! I play in 2k resolution, and the RX480 (even if overclocked) would struggle to keep even 30 FPS in some demanding games on high/ultra settings, but not this! I can max out all graphics settings and play at 2k resolution and keep over 60 FPS on every game I've tried! The only notable exception being Star Citizen, but being an Alpha it's terribly poorly optimized, and even the highest end systems struggle to keep 60 FPS everywhere. But I do keep a stable 45 FPS average, which is fantastic. Though most games are able to sustain 144 FPS as well, for an incredible gaming experience! Specially Elite Dangerous stays at 144 FPS even in large battles!\n\nI want to knock more stars off this card just for all the frustration I went through just to get it to even work, but since then I haven't had a single issue with the card. It runs perfectly now! So just go into getting this card (and I would assume other 5700XT boards may have this same issue) knowing that you're going to have to do some tweaks before you'll be able to use it. AMD has the absolute worst driver support, it's downright dreadful. But they've always been this way. If their software team could actually catch up to their hardware team, they'd probably be killing nVidia on all fronts. They just can't.\n\nSo overall, I definitely recommend this card for an upgrade. It was a huge upgrade for me and it's nice to have great gaming performance again. Just know you're going to likely have issues until they sort all of this out!"}, {"title": "2022 AMD Updated Drivers and Fixed Black Screen Issues Card is Amazing", "rating": "5", "location-date": "Reviewed in the United States on July 8, 2022", "text": "This card at launch when I purchased it was plagued with the same video card driver issues AMD has become notorious for in the community. However, now that years have passed since this card's release and AMD has sunk more money into optimizing their video cards for gaming, especially the new 6000 series cards, the result is that latest Adrenalin Software driver update in 2022 has this card screaming in games I play without stability issues I used to have.\n\nThe driver updates have also allowed me to fully use the various functions this card has like Radeon sharpening or input lag reduction etc. with no performance cost at all! Keep in mind that all of these improvements whilst still drawing the same power and without overclocking. That's right, stock speed baby. AMD has come through to finally fix these issues and I can recommend this card in July 2022 now that card prices are at or below MSRP and well worth it with current driver editions. Nice AMD!"}, {"title": "BIg card. Bit loud out of box. Can be tempered.", "rating": "5", "location-date": "Reviewed in the United States on January 20, 2020", "text": "I think this is really worth 4.5 stars, but I don't want to short-change it.\n\nThis card is pretty great given that it's usually the more budget-conscious of 5700XT. Which is not to say \"it works fine BUT...\" We've skipped some RGB but have a metal backplate and metal accents on a very solid-feeling shroud. Personally I don't care what the shroud feels like - I'm not going to really hold the thing. Make it look nice and call it a day. But the metal brackets and plates don't seem to hurt anything. An aggressive-looking shroud too, but not to a degree that it becomes cringey.\n\nIt's easy to lose reference on size in GPU cards especially when looking at dual-fan designs, and this one is quite large. It has a two-slot interface on the output-end of the card but it has a substantial radiator and does take up three slots worth of space over the motherboard. I had to give up wifi for this. mATX builders take not that you will only really be left with one slot available and miniITX that you may not fit into a tight case.\n\nThe temperatures and fan noise out of the box are the biggest concern here. AMD temperature reporting maybe looks worse than it is, but that isn't to say this card is fairly hot and loud as received due the the factory overclock/overvolt and aggressive fan curves. There is a bios switch to enable a more basic bios with less aggressive fan curves, but while it's easy, it's not going to be the best method of dealing with these issues. Better to use AMD's own Wattman from the Radeon drivers that you'll install anyways and use that to undervolt and tune some clock speeds. There's a very good chance that this will drop your temps enough and keep your fans from running so high. You could further tweak the fan curves to tune the speeds. I know this seems like a lot of overhead and it could encourage you to look elsewhere, but honestly it's not bad and something you should do for any 5700XT. So it's worth doing regardless.\n\nMake sure you have a good power supply, though. Recommended is a 600 W but you'll need both an 8-pin and a 6-pin power. There are adapters included and I won't say they won't work, but conventional wisdom is that you really should use those as a permanent solution. Can't say I've ever heard of it really causing a problem, though.\n\nOverall, I'm happy to have this as it has everything I need and it's very light on the gimmicks. I've got Destiny 2 running at 1440p and highest settings (except lighter AA and no motion blur) around 130-150 fps. A smallish but significant upgrade from my GTX 1080. I really think the value here is outstanding."}, {"title": "Best Bang For Bucks Secret!", "rating": "5", "location-date": "Reviewed in the United States on November 8, 2019", "text": "I did take a huge risk with this one, as upon ordering I saw a youtube video that says this card ran Hot and Loud! However, for those of you on the fence with this card, it is the lowest priced card right now of the 5700 XT. I say get it. Yes it does run hot and loud at stock settings! But I noticed that this card was Overclocked and overvolted from the factory! If you change the speed to the stock rated 1905 mhz, adjust the max voltage to .999 mv using globalwattman (AMD's provided driver) and adjust the fan curve accordingly, to keep the fan at or under 50%. The card stays cool at 67 degrees C all day and very quiet as it never gets hot enough for the fan to kick in at even 50% even at full load playing Red Dead 2 on Max Ultra Settings, with get this, NO NOTICEABLE DROP IN PERFORMANCE OR STABILITY AT THE LOWER VOLTAGE!! At this price point, it is a steal, anyone that says otherwise has very little knowledge with how AMD are notorious for overvolting their cards and how these cards were designed to be efficient. or they were probably paid by Nvidia.\n\nI was going to return this card and get the Red Devil, but with the adjusted settings, this card is good to go and is a steal at this price, as it outperforms the 1080 Ti and matches the performance of the RTX 2070 Super, albeit sans Ray Tracing. Get it MNOW!! Best purchase of my life.\n\nAnd if you're getting this card to play Red Dead 2, use the Vulkan API, it's really what this card was made for! It ran that game buttery smooth, no frame drops, no artifacts, no stutters! Wow! Coming from AMD!!? Seriously! Did not expect this!! And this is a Mid-Tiered card and is already competing with the Flagships!? Just wait until AMD gets serious and decide to bring out the big boys. One thing is I would buy many shares of AMD stocks now! The future is looking very good for them."}, {"title": "Might have to tighten screws", "rating": "5", "location-date": "Reviewed in the United States on February 6, 2020", "text": "So I just updated my review because I was having issues but now this card is working fine on stock settings. So first I got the card and it ran hot and got plenty of crashes in games stutter etc and it was due to two things. First I bought a ryzen 1600 af and 3600mhz memory and while it worked games would crash turned it down to 3200mhz. Then this video card I ran hot super hot and it was because the screws were loose on the backplate called support and they told me to tighten them after that I game flawless no issues. (also they said not too tight maybe one full turn or half I went 1.5 turns super tight and no issues. Now last the fan curve on these is pretty low but you can turn it up if needed and I would say only if your pushing this to 4k 60fps may you need to do that but 1440p is the sweet spot.\n\nAlso since i changed to these dark flash rgb fans this pc is super quiet and I never hear this card nor does it run hot stays at around 65-72, a lot of people are looking at junction temp which something new amd started showing it means that is the hottest point of the card but 100 or less is fine. If your getting a hot and loud card try to tighten the screws but i love this build and card I do wish it had more lights but its solid"}, {"title": "XFX Rx 5700XT Raw II", "rating": "5", "location-date": "Reviewed in the United States on April 17, 2020", "text": "If you are struggling to choose between this graphics card and the 2070 Super, stop searching and looking up FPS comparison. This is the best bang for your buck. Absolute beast for 1080p gaming and handles 1440p with ease. As for the driver issues that many people have complained about, they have been fixed and the new 20.4.1 drivers have resolved all issues. However, for some reason the card I received was overclocked out of the box. After researching, I found many people had experienced the same scenario. This was causing all my games to crash, and I couldn’t figure out why. I never suspected it was due to overclocking since I had never touched these settings(I’m a novice when it comes to performance tweaking). After many hours of headaches, driver updates, google searches, installs, and uninstalls. I realized that my base core-clock was at 2124.... a ridiculous overlock that would struggle even with the best cooling systems in the market. After down-clocking, I have not had any complaints, the card is fabulous. So to summarize, when you receive this card make sure it’s running at the base core clock advertised on amazon or manufacturer website.\nPros\n-No coil whine\n-Best performance for the price among 5700xt line PERIOD\n-Can handle any game at 1440p\nCons\n-Raw? More like cooked, can get hot. Usually hovers at 80\n-Loud\n-Beware of the out of box overclock"}, {"title": "For those Worried About Temperatures", "rating": "5", "location-date": "Reviewed in the United States on April 13, 2020", "text": "Now, seeing other reviews and the few scarce review videos on other websites reviewing this, I was cautious to buy this but went ahead to do so because of the relative small price. I was not disappointed, while I have a ASUS Full Tower case, the temperatures of the RAW II never exceed 60 C when the fan percentage is set around 60, even on Red Dead Redemption 2, on mostly high-ultra settings, and this is playing for an hour straight, with bad cable management in the case, and the down facing fans only inches away from the PSU.\n\nNeedless to say, there are no flashy RGBs nor are they needed, there are two small LEDs that turn red or blue to indicate if the PCIe Power is working however, the build of the plastic feels cheap, but it works fine for what it is, needless to say this is a BIG card and takes up around two and a half PCIe Slots, so consider this in mind with the length also being about 342mm.\n\nOtherwise this is the best graphics card I have owned and I recommend it for a \"budget\" high end card to play 1080p games on high."}, {"title": "Absolute beast", "rating": "5", "location-date": "Reviewed in the United States on November 11, 2019", "text": "Paired with a Ryzen 5 3600, X570 mobo, and ddr4 3000 this card is the 1440p sweet spot for sure. Have been playing Modern Warfare at well over 144fps on high settings.\n\n-Pros.\n• Extremely high build quality, with a full metal backplate that wraps almost completly around the card.\n• very very quite, don't have exact dbs but jesus this thing at 100% is way quiter than any other card ive used.\n• minimal lighting and no RGB this could be a con or a pro depending but im a minimal person when it comes to lights the only thing that is illuminated is the XFX logo in white.\n• price point. For the amount of graphical power you get, at $399 this thing is amazing.\n• low power consumption, i run a corsiar sf600 and this card works perfect with this psu.\n\n-Cons\n• large @2.9 slots this card needs plenty of space for proper clearance.\n• weight, now for most people this isnt a problem but my case doesnt have a traditional gpu bracket as it was intended for water cooled gpu's but luckly my Gigabyte X570 I mobo has a reinforced pcie slot and its been holding up very well.\n\nIf you can fit this card, its an absolute buy. Just be sure to double check your case specs."}, {"title": "The card has what it takes. Drivers are wonky", "rating": "4", "location-date": "Reviewed in the United States on May 4, 2020", "text": "This card can run most games at max settings 1440p in my experience. Overclocking and undervolted it to 2000 frequency and 1135mv and made a custom fan curve took the temps down for me. Ive had it for awhile now and have played through Metro Exodus, Shadow of the Tomb Raider MW2, and alot of online gaming on a 2700x 16gb ram 3600mhz and all games run beautifully. The only downside is the drivers... AMD seems to have a bad time with their drivers. From most reviews ive read i seem to have been lucky. I experience ''black screens'' maybe once or twice a week. I highly suggest doing a clean install before putting this card in. The black screens are annoying but i dont think its the card personally. just bad drivers. who know maybe youll get lucky like me and have minimal issues.\n\nOtherwise i recommend the card. Got it fof 369 and so far am happy with purchase"}, {"title": "Best 1440P GPU for the money!", "rating": "5", "location-date": "Reviewed in the United States on February 15, 2020", "text": "I'm a frugal computer builder that has been building and upgrading mine and my kids computers for the last 15 years. I always buy the GPU that will give me the best bang for the buck. That has included the GTX 8800 and most recently, the GTX 970. It was time for an upgrade and I planned to stay the course with Nvidia and the 2060 until I started reading reviews on the 5700 XT, so I decided to take a chance on AMD and bought the XFX 5700 XT. I also bought a 1440P monitor to enhance my game play visuals.\n\nI've been using the GPU for two months and I'm very satisfied with the purchase. You can't beat the bang for the buck. Outside of having a few instances where my computer has reset during a gaming session, its been all positive. I haven't changed any of the stock settings, outside of the fan curve and have not seen the card exceed 80C during benchmarks or games. Unless I'm pushing the card extremely hard, it is very quiet. I do make sure that my drivers are up to date."}]}, {"label": "Sapphire 11266-09-20G Radeon Nitro+ Rx 570 8GB GDDR5 Dual HDMI/ DVI-D/ Dual DP with Backplate (UEFI) PCI-E Graphics Card", "price": "199.00", "description": "Sapphire Radeon NITRO+ RX 570 8GB GDDR5 DUAL HDMI/DVI-D/DUAL DP w/backplate (UEFI) PCI-E Graphics Card.", "rating": "4.6", "Reviews": [{"title": "Money saver, powerhouse and stylish!", "rating": "5", "location-date": "Reviewed in the United States on October 31, 2018", "text": ""}, {"title": "Can run anything.", "rating": "5", "location-date": "Reviewed in the United States on January 29, 2019", "text": "I using an I5-7500 as CPU and this product as my GPU. I can run almost anything, for not saying almost anything. (I haven't test all the games) using Ultra/High graphics settings. The card keeps itself pretty cool, considering the load I put on it. Also, You can get 60 FPS, and even can with the latest driver software, you can record and stream to a lot of Streaming services, such as YouTube, Facebook and Twitch with ease. Supports up to 5 displays at the same time. And the power requirements aren't much. The minimum PSU for this, is 500w. But I would recommend getting a 600w just in case. Which 500w being the min, I can say is a great graphics card to have.\n\nUpdate: I'm now running a system with Ryzen 7 2700x, and I can play and broadcast using Radeon Adrenalin Software and I get stable 60 fps. It's been almost 2 years and still running with this card. I play with a super wide monitor, and it's pretty good."}, {"title": "Defective product, poor return, poor RMA. I'd recommend avoiding", "rating": "1", "location-date": "Reviewed in the United States on October 15, 2018", "text": "TL;DR The card is defective, the seller Platinum Micro Inc Wont take back (as a return was submitted 31 days after arrival of product), Amazon can't help with a return, RMA shipping per the requested method was almost $40. I'd recommend avoiding the card.\n\nI purchased a Nitro+ RX 570 8GB from Platinum Micro Inc on 8/29/18 and received the card 9/6/18. My wife and i were about to move so i didn't test the card until 10/4/18 when i found that there was an issue with the card. I tried to trouble shoot the problem myself through the 10/6/18 when i found some postings (see toms hardware, amd support, ect...) , that this was a known issue with the Sapphire cards and likely a bios problem. 17 and 18 series drivers i tried gave me an error reading \"No AMD graphics driver is installed, or the AMD driver is not functioning properly. Please install the AMD driver appropriate for your AMD hardware\" on BIOS 1 and i get frames about the same as my 5 year old 7870 on bios 2. Newer drivers read bios 2 as an RX 580 in GPU-Z and same issue with frame rates. The only way that BIOS 2 functions is with drivers that are almost a year old (17 series drivers) and makes me doubt support for current gen titles coming out this year. I filed for a return on 10/7/18 and was denied as i filed 1 day outside of the window. I first called amazon and asked about their 90 day A-Z guarantee and was told that because the seller was a 3rd party seller the 90 day guarantee didn't apply. I ran through Sapphire support for a few days before they recommended an RMA with their 3rd part RMA company, Althon Micro. Althon Micro has given me an rma number and on their email requested the use of bubble wrap and packing peanuts which with shipping ran about $40. I'm worried though that their fix for the problem is a bios re-flash which would void any factory warranty i have on this card. After this fiasco I'm avoiding sapphire cards. For the $320 that this card has cost me i should have just bought a better card and that's my recommendation to you."}, {"title": "Great 1080 Gaming for Cheap", "rating": "4", "location-date": "Reviewed in the United States on November 9, 2018", "text": "***UPDATE** Great card. Looked up all specs. Runs on PCI-3 for those wondering. This is from Sapphire’s spec sheet:\n\nGPU\nRX 570, 14 nm FinFET\n4th Graphics Core Next (GCN)\nEngine Clock\nUp to 1340 MHz, Boost\nStream Processors\n2304\nMemory Size/Bus\n8GB GDDR5/256-bit\nMemory Clock\n7000 MHz effective\nDisplays\nMaximum 5 Outputs\nInterface\nPCI-Express 3.0\nResolution\nDisplayPort: 5120×2880@60Hz\nHDMI: 4096×2160@60Hz\nDVI:2560x1600@60Hz\nOutput\n1x DVI-D\n2x HDMI\n2x DisplayPort 1.4\n\nIt's a good card. Double the speed of my R7 260X. Shipping method could have been better."}, {"title": "Great Card for PC Building Beginners", "rating": "5", "location-date": "Reviewed in the United States on May 30, 2019", "text": "This is a great card with decent overclocking power. Even when clocked to 1450MHz it stays pretty quiet. TRIXX software is perfect for controlling overclocks, fan speeds, and RGB lighting. At the time of buying this card, I got it for $189. This card is great for first time builds, not too expensive, lots of power, just a great card overall. Comparable to GTX 1060"}, {"title": "Ok but a bit dated", "rating": "5", "location-date": "Reviewed in the United States on March 21, 2019", "text": "Ended up switching to the rx590 but got lots of audio issues, so again swapped for 1660 ti, a big price difference from the rx570, but holy performance.. if your budget is limited though, this is still a great card."}, {"title": "5/5", "rating": "5", "location-date": "Reviewed in the United States on May 14, 2019", "text": "No complaints, the card looks and runs amazing. Using with a Ryzen 3 2200G, running all my games at at least 60FPS in 1080p.\n\nWould definitely recommend as a great budget video card."}, {"title": "I think I got ripped, or not?", "rating": "5", "location-date": "Reviewed in the United States on December 31, 2017", "text": "Apparent quality, dual BIOS, replaceable fans what's not to like?\nWhile doing basic diagnostics I discovered the card reporting as only\n4 GB VRAM. All diagnostics tools report only 4GB.\nThis despite my purchasing what was reputed to be * GB on the box :-("}, {"title": "Get a intel gpu", "rating": "3", "location-date": "Reviewed in the United States on January 2, 2019", "text": "No good for premier pro or any other video editing. For gaming it was so so. A 1060 nvidia is way faster and runs alot coolor then this card. Spend extra 30-40 for 1050 or 1060."}, {"title": "Can’t go wrong with this", "rating": "5", "location-date": "Reviewed in the United States on February 25, 2020", "text": "Pretty good for the money"}]}, {"label": "Colorlight S2 Sending Card Led Display Synchronous Control Card( V3.1 Version) with Software Configuration Instruction", "price": "122.00", "description": "Product Description:", "rating": "5", "Reviews": [{"title": "Timely Delivery", "rating": "5", "location-date": "Reviewed in the United States on October 26, 2020", "text": "The spare part (sending card) worked perfectly"}]}, {"label": "Asus GF GT1030-SL-2G-BRK PCIE3, 90YV0AT0-M0NA00", "price": "116.56", "description": "GT1030-SL-2G-BRK, GeForce GT 1030, 2 GB, GDDR5, 64 bit, 1920 x 1200 pixels, PCI Express 3.0", "rating": "4.4", "Reviews": [{"title": "Replaced Defective GTX780!", "rating": "5", "location-date": "Reviewed in the United States on April 17, 2022", "text": "Since we are in global shortage of everything, my 2x GTX 780s in SLI decided to kaput. So I got this to hold me over. This card works perfectly fine for everything I need it to to do. I don't do much gaming anymore, but I like to have high end cards for the times when I want to game. It's a great card, and I actually have it's little cousin that is only 1GB in another machine that has been around for a few years. Works like a charm. I expect this one to do the same until I get my hands on another higher end card(s)."}, {"title": "Adequate for setting up a quiet sound station", "rating": "4", "location-date": "Reviewed in the United States on November 9, 2021", "text": "I was looking for very low noise and low heat output for a recording and mixing workstation. This works fine and is barely warm to the touch when running audio software. Note that this model is the DDR version, not GDDR, so is not good for modern games."}, {"title": "Good for gaming if you adjust other things", "rating": "3", "location-date": "Reviewed in the United States on February 20, 2022", "text": "Good for gaming if you adjust game setting to play on specific hardware and monitors. I cold play GTA V on my TV if I set the game settings to normal. My TV is over five years old so the default levels would cause a slight freezing in the game as the 1030 maxed out resources. I recommend a 1050 or 1650 if you have the money but for basic hardware, it is only the bare minimum but that depends on the rest of your setup."}, {"title": "A GPU that is actually IN STOCK!", "rating": "5", "location-date": "Reviewed in the United States on December 23, 2021", "text": "I replaced a 2070 RTX with this card. My 2070 was crashing playing some legacy games, but this card handles them without any issues!"}, {"title": "Great looking little card I couldn't use", "rating": "5", "location-date": "Reviewed in the United States on June 24, 2021", "text": "This is a great little card. If the specs are accurate I would have been very happy. The HP PC I attempted to install the card in has the PCI slots facing the power supply. There was just two little clearance as I didn't actually have the extra PCI slot available for the heatsink clearance."}, {"title": "Overpriced but works well", "rating": "5", "location-date": "Reviewed in the United States on August 5, 2021", "text": "Great for low end games on a kids PC."}, {"title": "Not a huge computer guy but this looks great with my HD screen.", "rating": "5", "location-date": "Reviewed in the United States on January 7, 2022", "text": "Had it installed in less than 5 mins it seemed like. Looks great on high def. Screen! Very happy with the purchase."}, {"title": null, "rating": "5", "location-date": "Reviewed in Italy on July 9, 2022", "text": "Ho acquistato questa scheda grafica ASUS perché pensavo che ASUS fosse il top ma purtroppo ho dovuto ricredermi almeno su alcune caratteristiche di questo articolo. Nonostante sia stata pensata per sistemi Gaming Entry Level e per sistemi HTPC non riesce a gestire se non con affaticamento eccessivo la modalità DirectWrite (Direct2D). Infatti se uso una applicazione che ha bisogno di questa modalità il mio PC inizia a rallentare parecchio e la temperatura della GPU sale di 5 punti. Avendola acquistata per usare un Monitor 4K HDR da 28 pollici Samsung sono rimasto molto deluso nel vedere questo glitch. Per il resto è esageratamente alta il ché ha comportato che lo slot PCI-E 2.0X4 è stato occupato dalla scheda che come ingombro ha finito per nascondere lo slot, potrei anche spostare la scheda video sull'altro slot PCI-E 3.0X16 ma è troppo vicino alla CPU e alla sua ventola da 120 mm, dunque per me è un grosso problema, per il resto essendo un cooler di tipo passivo non fa rumore e anche se sale la temperatura non c'è rischio di bruciare o rompere la ventola perché non ci sono parti meccaniche. I 4K HDR li raggiunge a 60 Hz senza problemi, gli aggiornamenti dei driver li faccio direttamente dal sito ASUS invece di nVidia perché i driver che rilascia ASUS sono ottimizzati per questa scheda video. Ho una scheda madre ASUS Maximus Gene VII, un processore i7 4790K a 4.00 Ghz, 16 GB di RAM DDR3 a 1600 Mhz in dual channel, SSD da 512 GB, Monitor 4K HDR 28 pollici Samsung e due Hard Disk meccanici da 3 TB ciascuno WD RED. In 4K HDR la scheda fa 55 gradi centigradi a riposo d'estate, in inverno 47 gradi centigradi. Raggiunge i 70 gradi centigradi sotto sforzo, i giochi faticano tantissimo e li devo giocare alla risoluzione FullHD sia pure con dettagli al massimo. Nel complesso è un buon compromesso, occupa un solo slot del case e viene fornita con una staffa anche a basso profilo intercambiabile. Ovviamente ci faccio girare tranquillamente Windows 10 64bit. Vi lascio alle mie foto dalle quali vi potrete rendere meglio conto di ciò che ho scritto qui.\n\nValutazione complessiva:\n\nRisoluzione 4K HDR (a 60 Hz): ★★★★★\nVelocità di risposta del motore grafico: ★★\nCapacità di raffreddamento: ★★★★★\nCompatibilità con applicazioni moderne: ★★★\nPrezzo: ★★★★★\nIngombro: ★★★★★\nUscita HDMI: ★★★★★\n\nConclusione: ottima ma non eccellente. Un buon prodotto entry level per aggiornare un PC che ha qualche annetto di troppo. Valutazione finale: ★★★★\n\nGrazie!"}, {"title": null, "rating": "5", "location-date": "Reviewed in France on September 26, 2022", "text": "Parfait facile d'installation c est la deuxième je suis revenue dessus car pile poil ce dont j ai besoin et très bon rapport qualité prix"}, {"title": null, "rating": "3", "location-date": "Reviewed in Australia on May 13, 2020", "text": "Not sure if my item was missing parts, but the listing suggests this is a low profile card. However it comes pre-installed with a normal bracket.\n\nOtherwise this is a good option if you just require a basic GPU (ie. For AMD processors). Passive cooling is also a bonus if you're concern about noise."}]}, {"label": "NVIDIA Quadro FX 4800 FX4800 1.5GB 3D Professional Graphic Card", "price": "119.99", "description": "Genuine Apple NVIDIA Quadro FX 4800 1.5GB CUDA Video Card for the Mac ProManufacturer Part Number: 900-50607-1706-000, 900-50607+0504-201 1.5GB GDDR3 Frame Buffer 384-bit Memory Interface DVI-I DL + DVI-I DL + Stereo Outputs Compatible with Mac OS 10.5.7 or Later and Boot Camp Compatible with Mac Pro 3,1 or 4,1 or later", "rating": "4", "Reviews": [{"title": "A good card", "rating": "4", "location-date": "Reviewed in the United States on June 30, 2013", "text": "I bought this card to replace a ATI card in one of my machines, i had to cut out part of the frame in one the drive bays so it would fit, but that was the only setback card works good so far"}]}, {"label": "Low Profile Bracket, Half Height for Mini Computer Case, HDMI, VGA, DVI Output Interface, for SAPLOS RX 550", "price": "6.99", "description": "Low profile brackets", "rating": "3.8", "Reviews": [{"title": "The jury is still out", "rating": "3", "location-date": "Reviewed in the United States on February 15, 2022", "text": "I'm not a gamer, so I can't comment on that aspect. The image is nice and crisp and works well with the various graphics and animation packages I use. Watching videos on my 4K TV and they look really really good, even low res AVIs.\n\nHowever, this card has some serious quirks. I have a Windows theme going, and whenever the pictures on the monitors change, they all blink rapidly over the course of two or three seconds. There have been times when the screen has just gone black for about the same length of time. At first, it was annoying but livable. Lately, however, they are happening more and more. In my experience, that means the card is getting ready to fail. We'll see.\n\nThere are absolutely no instructions anywhere for this card, not even a recommended location to download drivers. That's not a problem if you're experienced with PCs, but if you aren't, that could be a stumbling block.\n\nI am also irritated that they didn't include any SFF brackets. This is not a cheap card (granted, it's not an expensive card either). Selling them as an add-on seems unnecessary. (I happened to have an old card with brackets that fit.)\n\nI will probably continue to look for another card, though I'm hoping prices will become more reasonable.\n\nEDIT: Well, the card continued to decline until it locked up the PC. Swapped out and put in my old card, which at least works. I'll leave the rating at 3 stars and assume I just got a lemon, but I'm not impressed with the quality control."}, {"title": "Check your software first", "rating": "4", "location-date": "Reviewed in the United States on May 11, 2022", "text": "It is a good card, but I didn't realize the software I use is Nvidia accelerated."}, {"title": "Decent Budget Performance", "rating": "3", "location-date": "Reviewed in the United States on January 4, 2022", "text": "I got what I paid for when it comes to budget ranged graphics cards, it can play most triple A titles medium to low settings at 30 fps but at 60 fps it struggles with temps and titles like Gears5 which it tops out about 48-50 fps though Gears5 is a graphical monster compared to other titles. Also I gave a score of 3 because it isn't as compatible with emulation as you would think which it also struggles but not all them like wii u,PS2 and 3ds it's performs at a decent level."}, {"title": "Works perfectly", "rating": "5", "location-date": "Reviewed in the United States on January 7, 2022", "text": "It's very small and thin. Which I needed to fit into an old Dell, it is truly single slot. I stuck it in my PC after swapping out the back plate for a low profile one and removing the vga, installed the RX 550 AMD drivers and it doubled the FPS in the game I was playing from 30 on low to 60 on high and that's all I wanted it for. Temps are in range for the card despite it's size. Also my PC only has a 180w power supply and this works just fine in it. Very pleased."}, {"title": "Definitely what I needed for my PC sim racing", "rating": "5", "location-date": "Reviewed in the United States on June 4, 2022", "text": "Great product would recommend it"}]}, {"label": "ASRock VGA RX6500XT PGD 4GO R", "price": "185.99", "description": "Dual Fan Design Two fans that provide strong cooling performance and make your gaming rig stay cool. It’s optimized for delivering excellent gaming experience with stylish and streamlined design. Striped Axial Fan Designed For Enhanced Airflow. ASRock’s custom Striped Axial Fan delivers enhanced airflow to optimize cooling from not only the stripe structure on each fan blade but also the polishing surface on the bottom side. Stylish Metal Backplate With the Phantom Gaming look, the stylish metal backplate on the Phantom Gaming graphics cards makes it more fancy in visual and solid in construction. Otherwise, the thermal pad at the backside also helps to enhance the thermal efficiency. 0dB Silent Cooling Spin For Cooling, Stop For Silence. The fan spins when the temperature goes high for the optimal cooling, and stops when the temperature goes low for the complete silence. Nano Thermal Paste Perfect Thermal Teamwork. Eliminate the gaps in the contact area to maximize heat transfer and thermal efficiency.", "rating": "4"}, {"label": "NVIDIA Titan RTX Graphics Card (Renewed)", "price": ".", "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.", "rating": "1", "Reviews": [{"title": "nvidia drivers are garbage", "rating": "1", "location-date": "Reviewed in the United States on September 20, 2022", "text": "And still can't handle displayport with multiple monitors properly after all of these years"}]}, {"label": "4GB DDR5 Graphics Card, Desktop Computer Network Accessories PCIE 2.0 Gaming Graphics Card 128Bit HD6770 650MHz, GPU for Gaming PC", "price": "73.50", "description": "Specification:\nItem Type:Graphics Card\nCore Bit Width: 128bit\nVideo Memory Capacity: 4GB\nCore Frequency: 650MHz\n3D API DirectX 12\nGraphics Slot: PCI Express 2.0\nVideo Memory Type: DDR5\nVideo Memory Frequency: 1000MHz\nVideo Memory Bit Width: 128bit\nStream Processor Unit: 480units\n\nPackage List:\n1 x Graphics Card\n1 x CD", "rating": "2.8", "Reviews": [{"title": "Perfect fit", "rating": "3", "location-date": "Reviewed in the United States on October 1, 2022", "text": "Chipset is older legacy Chipset so it will not use the newer drivers, and nothing is being developed for it. Works with Win10 and it is a good card for everyday computing, but I would not recommend it for gaming, specifically on the Win 10 home edition or Windows 11. Card crashes for almost all high-resolution games on Steam, Xbox and Epic Games. So far, the only game it does not crash on is Minecraft. Contacted support but did where not able to get the problem resolved."}, {"title": "Muy bulliciosa", "rating": "5", "location-date": "Reviewed in the United States on September 13, 2022", "text": "Pc de mi hijo, y es bulliciosa solo de encender el pc"}, {"title": "Do any cards you sell work?", "rating": "1", "location-date": "Reviewed in the United States on August 24, 2022", "text": "I don't think any of these video cards work right at all. I spent my month period trying to figure out why it wouldn't work with the desktop I have. Because I belive in trying every possible situation by troubleshooting the part before just sending it back and maybe the same thing happens. This card got here May 1st. At first I only had 1 desktop and two laptops. Oh and trust me, I even tried the laptops, I bought a e2mc to usb chord, (e2mc is the new smaller adaptors for solid state hard drives and wireless cards, and yes you can plug into that put your card on a riser) Basically I tried everything. On the first card, I bought from this company it didn't work. With anything! I feel like the day it came in was the day I woke up and stepped into the outer ring of hell. Anything involving this product turns into work wasted. Can I at least send it back to you guys so I can get this paperweight of a reminder of this off my desk?"}, {"title": "4k??", "rating": "2", "location-date": "Reviewed in the United States on April 28, 2022", "text": "Well give you a heads up, this is an older card made to look uptodate, ity does not need add on power from the power supply, it looks nice but the max res is 1080, sor if you have a 4k tv and most people do,\nthis card will disappoint you as it hase me,bummer."}, {"title": "Customer service", "rating": "5", "location-date": "Reviewed in the United States on April 12, 2022", "text": "Had some issues getting it to work but customer service was on Point"}, {"title": "Don't be Fooled by the Low Price... Like I Was!", "rating": "1", "location-date": "Reviewed in the United States on May 6, 2022", "text": "The installation program didn't work. Started to run but froze up. Half the instructions (actually screenshots of the install program) are in Chinese, and the rest are in something that looks like English but is pretty confusing and incomprehensible. (See scan of part of the instructions.)"}, {"title": "Never buying it again!", "rating": "1", "location-date": "Reviewed in the United States on July 8, 2022", "text": "When I open the my games, it would play fine, until seconds later, it would close on me."}, {"title": "HD5770s and 6770s never came with 4GB of VRAM! AVOID!!", "rating": "1", "location-date": "Reviewed in the United States on July 21, 2022", "text": "The vast majority of HD6770s did not come with a VGA port. The real ones also require a 6-pin power connector. Most cards that have an output layout like this are fake and, seeing reviews from people saying it won't run DX11, I'm inclined to believe this isn't even a 6770 as those did run DX11. The listed clock speed is about 200mhz lower than the original cards which, at best, points to these being faulty cards flashed with a different BIOS to operate at a lower clock speed. HD 5770s and 6770s (same card with 2 names) also NEVER came with 4GB of VRAM.\n\nAgain, this points to this being a card with a fake BIOS. I've tested another faked GPU claiming to be a GTX 960 4GB and the card even reported itself as such to the computer. In actuality it was a GT640 with 1GB of VRAM. When a game would try to utilize the reported 4GB of VRAM that didn't exist, it would cause the computer to crash.\n\nBest case scenario here, you get a GPU that was originally released in 2009 (as the 5770, again, identical to the 6770...AMD just renamed the same card 2 years later) which has not received driver support since 2015, running at 76% of it's original speed (which may be how it gets away without a 6 pin power connector...but I doubt it) and have to spend some time dialing in settings to avoid games using more than 1GB of VRAM so the computer won't crash. In other words KEEP SHOPPING!"}]}, {"label": "MAXSUN AMD Radeon RX 550 4GB GDDR5 ITX Computer PC Gaming Video Graphics Card GPU 128-Bit DirectX 12 PCI Express X16 3.0 DVI-D Dual Link, HDMI, DisplayPort", "price": "131.18", "description": null, "rating": "4.2", "Reviews": [{"title": "Great budget card", "rating": "4", "location-date": "Reviewed in the United States on October 12, 2022", "text": "Old man Dad on a budget here. Purchased this to upgrade from onboard graphics when stadia was announced that they were cancelling.\n\nSlapped it in, loaded up Elder Scrolls Online and can say I'm pleased with the card. I run it on the high setting no problem. It can handle ultra but the framerate drops below my comfort but it can run it.\n\nFor a budget card it works well for me. Would recommend.\n\n(I'm running a 10th gen core i5 with only 16gb of ram...still the card performs better than expected)"}, {"title": "I NEEDED A CARD TO CRUISE AROUND THE INTERNET WITHOUT ISSUE AND THIS IS IT!", "rating": "4", "location-date": "Reviewed in the United States on March 8, 2022", "text": "I just needed a basic video card to cruise around the internet without being stifled by lame performance of a cheap video card. While this card is a tad expensive it is not priced at the ridiculously insane prices of the middle to high end gaming video cards in 2022. This GPU has done the job of letting me go anywhere on the internet without video lag.\n\nI had a more expensive NVIDIA GPU in my system with otherwise state of the art hardware. The newest most power Ryzen 9 \\ 5900 CPU, fast memory and a 750 watt power supply. The NVIDIA GPU ran like hot garbage on my Ubuntu system. Ubuntu has a nasty sepia color scheme that saturates the entire OS and everything in it. It is not only ugly but painful to look at due to my vision issues.\n\nI did not know for sure at the time but, I hoped a new video card from someone other than NVIDIA might perform better. Turns out this AMD designed GPU got rid of the nasty sepia tint. This video card creates a simple un-tinted OS that is a pleasure to use. The card is not BIG and uses only the power supplied by the GPU slot.\n\nThe card has some energy saver garbage installed that turns the card off if you power down your monitor. I took a star off for the energy saver mess. There really are no other issues. This is a great card to use on a Linux\\Ubuntu system that is not used for hard core gaming."}, {"title": "Great for what I needed", "rating": "5", "location-date": "Reviewed in the United States on September 27, 2022", "text": "Better than the on board graphics, I don't play intensive graphics heavy games. Videos and streaming looks great!"}, {"title": "Perfect for Light to Mid Gaming", "rating": "4", "location-date": "Reviewed in the United States on June 29, 2022", "text": "16 GB ram on my computer and this and I'm able to play most games such as\nDying light 2, Sea of thieves and modded Minecraft.\nMy buddy with a 12 GB ram able to run these as well.\nJust popped this sucker in and it works for us. Any cheaper and you're not running much it seems.\nPerfect medium."}, {"title": "Does very well with starters for gaming!", "rating": "5", "location-date": "Reviewed in the United States on September 1, 2022", "text": "I see that some of you who don’t like the pricing… the pricing for other ones keep going up! To say I was not surprised to not see an plug in with no instructions to have a plug in for the chords for it🤷🏽‍♂️"}, {"title": "Plays EVE good.", "rating": "5", "location-date": "Reviewed in the United States on October 1, 2022", "text": "Plays EVE good."}, {"title": "Ok card for the price, considering the current market", "rating": "4", "location-date": "Reviewed in the United States on March 18, 2022", "text": "This works pretty well. It runs Skyrim at the highest settings on my rig pretty well. Does not manage Cyberpunk on anything higher than medium settings. I bought it because it was a decent entry level GPU at a lower price point. I now wish I would have spend an extra couple hundred, but you get what you pay for. With current demand for graphics cards up and supply down, it's not a bad value."}, {"title": "This is a basic graphics card that does a good job for photo editing, and watching movies, videos.", "rating": "5", "location-date": "Reviewed in the United States on August 4, 2022", "text": "This is a basic card. It will not satisfy hard core gamers or crypto traders (if there are any left!) If you want something to use for photo editing, watching videos, and basic computer use, it will work quite well."}, {"title": "Great for what it is", "rating": "5", "location-date": "Reviewed in the United States on April 23, 2022", "text": "I recently built my first gaming pc in 20 years. I ordered everything but the graphics card, and when I went to research and price them... Whoa! Man have things changed in 20 years! Needless to say I needed something until I could afford a good graphics card. Enter MaxSun Radeon RX550. This card actually impressed me. Not only was I able to get my system up and running, I was also able to play a few of my favorite games, like BeamNG.drive. Granted, the settings were on Low and some on Medium, and the FPS wasn't optimal, but it was definitely playable.\n\nWhile I wouldn't recommend this as a primary card for gaming, it makes a great backup."}, {"title": "Great budget card", "rating": "5", "location-date": "Reviewed in the United States on June 7, 2022", "text": "WOW - what a difference from my old graphics card. My PC only has a 400 watt power supply and this one plugs directly into the motherboard and doesn't require any other power cables to be connected. And I was able to take full advantage of the Radeon technology in my monitor - was able to set it to 185mhz refresh rate too. Fortnite looks 1000 times better!"}]}, {"label": "MAXSUN AMD Radeon RX 550 4GB Low Profile Small Form Factor Video Graphics Card for Gaming Computer PC GPU GDDR5 ITX SFF HDPC 128-Bit DirectX 12 PCI Express X16 3.0, HDMI, DisplayPort", "price": "159.99", "description": null, "rating": "4.5", "Reviews": [{"title": "It does what I needed it to do", "rating": "5", "location-date": "Reviewed in the United States on July 27, 2022", "text": "At my workplace I needed this half-height graphics card for a PC running a graphics intensive application that was practically unusable using the on-board graphics on the PC. Installing this card resolved the performance issues. I was pleased enough with that purchase that I bought one for my home computer to resolve some lag issues when playing 4K video on my old PC. This card resolved that issue, too. I don't know how this product benchmarks against the completion. I didn't do any testing like that. I simply had performance issues with applications that needed a graphics card performance boost. The price was right on this graphics card and I found that it worked fine to resolve those issues.\n\nThe only issue that I had was that the package came with no English instructions, no drivers and no software. I am an IT technician by trade, so I had little trouble finding the right drivers and software online. On one PC, Windows Update found the drivers, but I still had to download and install the correct version of the Radeon software. On the other PC I had to download both the drivers and software. So, this wasn't much of a problem for me, but it may be more than a novice PC users can deal with.\n\nThis product did what I needed and I've had no problems with it either at home or at work. It gets a 5 star rating from me even though I would have expected better instructions for installing the product and obtaining the correct drivers & software."}, {"title": "Works Great. No Extra Power Needed.", "rating": "5", "location-date": "Reviewed in the United States on June 27, 2022", "text": "I needed a low profile video card for a small form factor computer that didn't require it's own power source, and didn't cost a fortune. This one fit all 3 requirements. It was a simple install and the software was easy to find and download."}, {"title": null, "rating": "5", "location-date": "Reviewed in Germany on August 29, 2022", "text": "Diese Grafikkarte ist absolout NICHT VR fähig ! Wer VR möchte MUSS mehr investieren !\n\nDennoch möchte ich diese Grafikkarte einmal für ihre erstaunliche und herausragende Leistung loben.\nHier hat MAXSUN alles richtig gemacht!\n\nIch habe einen Rechner mit ordentlich Leistung und natürlich auch mit einer entsprechenden Grafikkarte um damit die Valve Index VR-Brille zu betreiben. Ich bekam ein ausrangiertes Fujitsu Esprimo C710 mit USB3.0 und einem betagten aber ausreichenden Prozessor und suchte nun nach einer Low Profile Grafikkarte, die dabei auch noch schlank und bestmögliche Leistung bringen sollte.\n\nMein verrückter Plan:\nWenn an meinem Rechner was abraucht, sollte der kleine Esprimo das Ganze überbrücken.\nMit 32GB RAM und der MAXSUN Radeon RX 550 ist mir das sehr gut gelungen.\nWir reden hier natürlich von minimalistischen Grafikeinstellungen ABER BeatSaber, Phasmophobia (SinglePlayer), Pistol Whip und Blade & Sorcery sind durchaus spielbar und die Karte wird dabei nicht übermäßig heiß. Half Life - Alyx hingegen lagt sehr deutlich (wie es auch zu erwarten ist)\n\nDies ist keine Kaufempfehlung für VR, es soll aber verdeutlichen, was die kleine Karte auf dem Kasten hat.\nDenn hier schlägt sie die vergleichbare GT 1030 um längen. Für Titel wie Diablo III und Co ifinde ich die RX 550 völlig in Ordnung und sie macht dort auch eine echt gute Figur.\n\nFazit: Es gibt natürlich deutlich stärkere Grafikkarten, egal ob AMD oder NVIDIA aber wer bei dem aktuellen Auf und Ab der Grafikkartenpreise eine günstige und verhältnismäßig starke Grafikkarte sucht, weil er sich gerade keine große leisten kann oder wie bei mir für einen kleineren Zweitrechner, sollte hier gut bedient sein."}, {"title": null, "rating": "5", "location-date": "Reviewed in Germany on September 7, 2022", "text": "Hab wirklich lange und intensiv nach einer neuen, bezahlbaren und vom Preis nicht so abgehobenen Grafikkarte gesucht. Hier passt das Preis/Leistungsverhältnis für mich gerade noch so. Wir zocken wenig wenn dann Strategiespiele, Autorennen usw eine unserer Anforderungen war die Grafik entscheidend zu verbessern ohne Unmengen Geld zu investieren. Also neuer Monitor, Grafikkarte und ein zusätzlicher Speicherblock. Das Ergebnis kann sich mehr als sehen lassen!!!\nKein geruckel mehr und eine schön saubere Grafik, das beste die Grafikkarte wird bei uns nicht mal warm, läuft also alles sauber. Für 160€ kann man bei der Karte nichts verkehrt machen!"}, {"title": null, "rating": "5", "location-date": "Reviewed in Spain on August 27, 2022", "text": "Precio un pelin subido pero viendo lo que hay pues no esta mal se defiende bien con juegos como the witcher 3 asi que a mi me vale."}, {"title": null, "rating": "5", "location-date": "Reviewed in Germany on August 3, 2022", "text": "Sehr gut verpackt.\nLeichter Einbau. Mußte nur den Halter von groß auf kleine umbauen. War im Paket.\nSchnelle Karte, läuft unter Windows 11 hervorragend.\nPreis Leistung ist gut."}]}, {"label": "QIANRENON PCI-E 1X to 16X Riser Card Adapter Extender Graphics Adapter Convertor Board for 1U 2U Motherboard Replacement,Graphics Card, Network Card etc", "price": "14.99", "description": "Type: Riser Card\nStability strong\nThe middle with a soft cable connection\n1X to 16X flexible cable connection adapter, design for 1U, 2U server small chassis expansion\nProduct length: 10cm / 3.93in\nPackage Included\n1 pcs PCI-E 1X to 16X Riser Card Adapter.", "rating": null}, {"label": "MAXSUN GEFORCE GT 1030 4GB GDDR4 Video Graphics Card GPU Mini ITX Design, HDMI, DVI-D, Single Fan Cooling System", "price": "117.99", "description": null, "rating": "4.2", "Reviews": [{"title": "Card for people that know how to use a computer", "rating": "4", "location-date": "Reviewed in the United States on July 18, 2022", "text": "I have an older computer with only pcie 2.0 and my graphic card died not even two years old. Because the ati graphic i had died not being even 2 years old and more expensive i decided to buy this one. Card does not come with driver or instructions how to get them. It took me half a day to get the actual Nvidia drivers do run with win11. It seems to run okish now but I'm having problems with the video im working on that i didn't have before with the old card."}, {"title": "Works great", "rating": "5", "location-date": "Reviewed in the United States on August 25, 2022", "text": "I use this graphics card for X-Plane on an older Intel 4790 that only supports DDR-3 memory. The program demands a lot of video resources, which the GD-1030 supplies. I cannot run at the highest frame rates, but it runs quite well. I am very satisfied with this graphics card."}, {"title": "A solution to a problem.", "rating": "4", "location-date": "Reviewed in the United States on April 6, 2022", "text": "A family member had their monitor burn out and a 4K monitor was bought. Sadly, the built-in video card in the older computer was not strong enough to support the max resolution.\n\nThis video card did exactly that. And it is fine for a computer that is used for surfing, basic desktop work, etc. But once you want to watch a full-screen 4K video it struggles. Badly.\nTo be fair here, the 10-series were not built for 4K. But it needs to be said: it is one thing to do static work on 4K resolutions; once you go to a high-quality media display this is not the card you are looking for.\n\nSo this card does what it needs to do - and it will perform fine for most things in resolutions under 4k. It is affordable and available. But don't buy this one for high-quality gaming or intensive video or animation work."}, {"title": "Probably was a return", "rating": "4", "location-date": "Reviewed in the United States on January 2, 2022", "text": "Some of the previous reviewers had opined that there cards might have been returns. I received an open box (no factory tape on the folds) and no documentation on the inside. No disk, manual, or anything for that matter other than the card. Obviously a return. Forewarned is forearmed and I had already gone to the Maxsun website and downloaded the latest drivers. I installed the card and, in fairness, works as advertised. The vendor just needs to ensure that the documentation is in every box. I also haven't registered it (no disk asking me to) but will do that on the website. Arrived on time."}, {"title": "Replacement for a failed card.", "rating": "4", "location-date": "Reviewed in the United States on April 18, 2022", "text": "It's a decent substitute to be able to run games, but it isn't a great card. Not even an average card now. Thankfully I've got a RTX Ti 3080 on the way."}, {"title": "The Graphics boost is pretty cool!", "rating": "5", "location-date": "Reviewed in the United States on May 19, 2022", "text": "Amazed on the performance boost I got. I upgraded my dell with 16 gig (from 8), SSD (from HDD), and now this video card which blows the doors out for the graphics performance I was getting before, for video rendering. No addtional power supply needed, either. It seems happy with my 224w. Very happy. Thanks again!"}, {"title": "Calling all base model alien ware x51 users", "rating": "5", "location-date": "Reviewed in the United States on October 8, 2021", "text": "Okay so to start , can you run gears 5 on 4k absolutely not. Can you run in a stock Alienware x51 without upgrading your power brick and running extra power ? Absolutely yes! Fits right in slim designed case , total install time was 10 min if that. I have looked high and I've looked low for a form fitting card for the x51 without a massive power overhaul. This card is not what I call \"gaming\" ready but the price point should sell you that. Overall it's slim will definitely fit in a modular case and does the trick of you are looking to do anything that's graphic hungry. Minus of course Fortnite at 60fps consistent. The value is peek. The extra 2gb of room helps to. Hope this is your final review to read before pulling the trigger. I did , great product in an oversaturated market currently"}, {"title": "Perfect for the price in today's market!", "rating": "5", "location-date": "Reviewed in the United States on January 5, 2022", "text": "This GPU isn't the top of the line, but paired with my 60hz 2560x1600 HP monitor, it's given me crystal clear images with good FPS in Halo Infinite (@1366x768 for H.I. only), Kerbal Space Program, and Automation, the Car Company Tycoon Game. Though in Beam.NG, visual settings have to be set to Low for decent-good FPS. It keeps at a decent temperature (35-45°C) while being run at 100% consistently. If you're looking for a good GPU for 3D dense programs such as Second Life, this one is more then capable with the sacrifice of FPS (25-30 at High, 10-15 at Ultra graphics settings)."}, {"title": "THE BOX WAS OPEN BUT STILL WORKS", "rating": "3", "location-date": "Reviewed in the United States on February 12, 2022", "text": "From previous reviews I had seen people get open box not new cards and I knew what I was getting into no installation set up stuff or anything but a Chinese version which is cool but can't read .nvidia automatically updated my drivers so I have the current for the card but open box that's what breaks the deal a little for me should disclose the cards are opened and possibly refurbished still good runs warzone at 30 fps on low and it's playable just not the best hope this helps ."}, {"title": "Todo como lo descrito.", "rating": "5", "location-date": "Reviewed in the United States on April 22, 2022", "text": "Se instaló sin problemas, los drivers de la página de envía se instalaron sin problemas, no recalienta nada a pesar de tener solo 1 ventilador ya que no necesita conexión directa a la fuente de poder. Veremos más adelante como sigue en rendimiento..."}]}, {"label": "GIGABYTE GeForce RTX 3070 Ti Eagle OC 8G Graphics Card, WINDFORCE 3X Cooling System, 8GB 256-bit GDDR6X, GV-N307TEAGLE OC-8GD Video Card", "price": "824.00", "description": "NVIDIA Ampere Streaming Multiprocessors 2nd Generation RT Cores 3rd Generation Tensor Cores Powered by GeForce RTX 3070 Ti Integrated with 8GB GDDR6X 256-bit memory interface WINDFORCE 3X Cooling System with alternate spinning fans RGB Fusion 2.0 Protection metal back plate 2x HDMI 2.1, 2x DisplayPort 1.4 Core Clock: 1800 MHz. Get the ultimate gaming performance with AORUS RTX 3070 Ti Graphics Cards. Powered by NVIDIA's 2nd gen RTX architecture and refined with GIGABYTE's WINDFORCE cooling technology, the GeForce RTX 3070 Ti EAGLE OC 8G brings stunning visuals, amazingly fast frame rates, and AI acceleration to games and creative applications with its enhanced RT Cores and Tensor Cores, and superfast G6X memory.", "rating": "4.3", "Reviews": [{"title": "worth the money", "rating": "5", "location-date": "Reviewed in the United States on July 30, 2022", "text": "been using this video card for 6 months. find it well worth the money it middle range video card and can run most rps games. my only complaint it is gets a bit noisy when running at full speed. but all in all very happy with this card."}, {"title": null, "rating": "5", "location-date": "Reviewed in Mexico on January 12, 2022", "text": "Que cumple de acuerdo a la descripción y tiene muy buena calidad en las protecciones de los juegos"}]}, {"label": "PCI Card Graphics VGA Card 8MB 32Bit Desktop Computer Component Accessories MultiDisplay for ATI Rage XL", "price": "16.58", "description": "Specification:", "rating": "3.9", "Reviews": [{"title": null, "rating": "4", "location-date": "Reviewed in Canada on January 2, 2021", "text": "Installed on a back-end server with no integrated graphic chip. Does the job, no issue for FreeBSD to recognize the graphic card. A bit surprise however that it came in a PCI EXPRESS extension card package... Made me wonder if the card is new or used."}]}, {"label": "MTQY Low Profile Half Height Bracket 2PCS Low Profile / Half Height Slot Brackets for HDMI, VGA and DVI ATI Nvidia Video Graphics Card", "price": "7.59", "description": "Specification:\nIt is compatible with shorter graphics cards and needs to be installed in a slim tower chassis.\nThe height is about 3.1, suitable for standard ultra-thin tower chassis.\nColor as shown.\n\n\nPackage content: 1 set of thin bracket\n1PC LP bracket (DVI + HDMI)\n1PC LP bracket (VGA)", "rating": "4.6", "Reviews": [{"title": "worked as expected, fit without issues", "rating": "5", "location-date": "Reviewed in the United States on August 22, 2022", "text": "Glad to get both 2 pcs brackets for different cards."}]}, {"label": "MSI Gaming GeForce RTX 2080 Super 8GB GDRR6 256-Bit HDMI/DP Nvlink Tri-Frozr Turing Architecture Overclocked Graphics Card (RTX 2080 Super Gaming X Trio) (Renewed)", "price": ".", "description": "Output, DisplayPort x 3 (V1.4) HDMI 2.0B x 1", "rating": "3.8", "Reviews": [{"title": "Overpriced and not worth this much.", "rating": "2", "location-date": "Reviewed in the United States on February 22, 2021", "text": "The RTX 20 series has been discontinued if you didn't know and the 3080 is the same price and it really shouldn't, It's way to overpriced for a 2080 Ti. At best these types of cards should only be between 800/900 or 600. Don't fall and buy this, I'm waiting for a 3080 right now and it's the same price so do not buy this at this price, the 2080 is still really good but chances are that its a refurbished or used card."}, {"title": "Do not trust", "rating": "2", "location-date": "Reviewed in the United States on June 6, 2021", "text": "Purchased and received a regular 2080 RTX. The advertisement is false -- is not a 2080 RTX TI"}, {"title": "LOL", "rating": "1", "location-date": "Reviewed in the United States on May 1, 2021", "text": "I could buy a pre built computer for $1500, this price is a joke"}, {"title": "Lol", "rating": "3", "location-date": "Reviewed in the United States on March 27, 2021", "text": "This is a joke, right?"}]}, {"label": "NVIDIA GeForce RTX NVLINK Bridge Quad-Slot - 80 mm", "price": null, "description": "NVIDIA GeForce RTX NVLINK Bridge Quad-Slot - 80 mm", "rating": "4.1", "Reviews": [{"title": null, "rating": "5", "location-date": "Reviewed in Germany on February 16, 2022", "text": "Es ist nach ein paar Tagen nach dem bestellen angekommen. Es hat funktioniert das einzige Problem das ich damit hatte war das bei meiner 2ten Grafikkarte die Nv Link Schnittstelle 5 mm weiter beim Motherboard war als der andere. Es ging sich aus jedoch sitzt durch die steife Bauweise der Nv Link ein bisschen schief.\n\n9/10"}, {"title": null, "rating": "1", "location-date": "Reviewed in France on July 7, 2022", "text": "Par manque de précision dans la description j'ai commandé le bridge pour lier 2 cartes RTX3090 mais ce bridge n'est compatible qu'avec la série RTX20."}, {"title": null, "rating": "5", "location-date": "Reviewed in Germany on December 28, 2019", "text": "Es handelt sich hierbei um die 4 Slot breite Version. Dies geht nicht aus der Beschreibung hervor, daher geht dieser Artikel leider zurück"}, {"title": null, "rating": "5", "location-date": "Reviewed in Poland on October 9, 2022", "text": "Przesyłka szybka i bezproblemowa. Dzięki! Mostek działa tylko brak czasu na testy :)"}]}, {"label": "GPU Stand,Graphics Card GPU Brace Support,Video Card Sag Holder Bracket Black (S)", "price": "12.90", "description": "Fitment: Prevents sagging and stress on motherboard, Design with hidden magnet on bottom, Tool-free Screw design, Fully Made of Alumium Alloy.", "rating": null}, {"label": "PowerColor Radeon RX 5700 XT 8GB GDDR6 Graphics Card, Model Number: AXRX 5700XT 8GBD6-3DH", "price": "296.10", "description": "PowerColor Radeon RX 5700 XT.", "rating": "4.1", "Reviews": [{"title": "perfect card for my sff build", "rating": "5", "location-date": "Reviewed in the United States on October 15, 2020", "text": "ok this is going to be a long one so bare with me here but i think it will clear a lot of quistions up that seem to be on peoples mind when contemplating purchasing this exact model rx 5700xt by power color(axrx 5700xt 8gbd6-3dh)\n\nok first this is not a big card, I knew it was going to be on the small side but i did not expect it to be no bigger than the older model rx 570s from the likes of gigabyte or xfx and actually when i hold them up side by side this card is actually smaller than my Nvidia rtx 2060 super founders card and that was a surprisingly small card, so this is a perfect size for the case i have included in the photos thats the case i have put this card into\n--given this cards petite build and very light weight i had ZERO expectations for good thermal management...but continue reading and i think i will effectively covey just how wrong i was about that but keep in mind that this case has the gpu literally right on the side with a massive intake basically spanning the entire side of the case were the pcie slot is so that is undoubtedly influencing my thermals and fan noise\nok on to performance. first lets identify my hardware here with a list of my parts that are in this build so we can get a better idea of how well this runs as a complete product because how useless are gpu performance and thermal numbers without knowing full system specs and how the performance and thermals of a graphics card influences total system performance\n*case - silverstone sugo sg13b mesh\n*cpu - intel i7 8700k\n*cpu cooler - corsair h60(2018) 120mm closed loop liquid cooler\n*motherboard - msi z370i pro carbon mini itx\n*ram - corsair vengance pro ddr4 16gb(2x8gb) at 3600mhz at cas16\n*ssd - samsung 950 pro(first gen) m.2 nVME 512gb ssd for windows 10\n*ssd - silicon power a40 256gb sata 2.5in ssd for a cut down debian linux install for phoronix test suite(for testing)\n*hdd - Western Digital white label 8TB red drive that runs at 5900rpm pulled from a WD external drive\n*psu - Thermaltake white label 700watt 80+ white certified( this was a concern at first as i was not confedent this was going to be able to power all my hardware reliably and altho i have long term usage concerns now after i replaced the 120mm fan with a pwm fan and ran the pwm signal wire to the motherboard for advanced thermal control i am not worried at the moment but i will look into picking up a at least bronze certified of the same specs but also keep in mind that with this form factor the only system fans i have are the intake 120mm for the AIO cooler and the 120mm on the power supply so i needed to mod this in order to have more granular control of both fans and i must say im super stoked that i did because all that in this case makes for a perfect air duct from the front over the board and out the back via the psu now adding a relatively hot GPU into the mix was the last thing i wanted but looking at the total system performance im shur glad i did because of the way this case is built this gpu easily pulls in its own fresh air from the side and throws ip up towards the vents on top so even if this gpu hits 90c on the junction it end up having very little effect on full system temps\nok giving all those specs i was not expecting super high performance even tho there is no reason a i7 8700k cant still handle high fps gaming at a modest 2560x1440 at around 120 to 144fps and to my suprise it did just fine\nok on to the thermals wich is arguably the most concerning for people when considering this card and unless i completely won the silicon lottery it duz not need to concern anybody i fan a full 6 hour stress test in furmark and shur my junction temps came close to 90c but never hit that but the core stayed under 80c the hole time and the memory temps stayed under 60c the whole time, ran ran this stress test in conjunction with a small fft stress on my cpu so i could get a total system thermal worse case and that were these temps came from when i just ran the furmark stress test i didn't come anywhere near this high of temps on the card and all together i dont think i ever got higher than 30c above ambient here in Nebraska were its getting a little chili out lol\nok so here are my final thoughts on this, if you are looking for a amd gpu that is very high performance and you dont want to wait for maybe ever for rdna 2 and you need something that is going to fit into a small case with good airflow this is the card for you also it has the added bonus of being slightly obscure so the prices are usly the lowest for a new rx 5700xt at least at the time of righting this, now that being sead if you can afford the price and physical real estate of going with a bigger card with possibly 3fans you will simply have much better performance numbers and even possibly be able to overclock a little bit (by that i mean allow watt man to overclock for you as its basically fully automated at this point im super excited about that little development as i also have the giant xfx rx 5700xt thik 3 model that is setup with dual bios so i can take one and just go to town on the overclock and push close to 220watts, but thats for a different review that i will also be making here on that once my absolute army of tests is done\nok now to address so other concerns i was reading on other reviews...right now as of today the 15th of October 2020 i am running the latest optional drivers from amd and i am seeing ZERO instability and the thermals and total power consumption are well within spec( at he hottest my card was pulling 180watts) and that is with the stock performance setting on wattman no over volt or overclock or the opposite i didn't under clock anything either i specifically wanted to find out what the OUT OF BOX experience was going to be like so i could put some information out there for others to help them make a decision on this seemingly to good to be true obscure graphics card from power color and i believe i have done that...\\\nmy conclusion is if PCPARTSPICKER list is saying this is the best card that will fit in your build than buy it if there are clear options for bigger cards like the red devil or the asus strix than buy one of those instead or even the xfx thic 3 but i have heard of thermal issues with the thic 2 but in reality if your running a normal size none sff case the 3 fan thic 3 is going to fit its no bigger than any other 3 slot card(actually uses only 2 pcie slots but the card itsslef is super thick and takes up 3 internally) ok but thats not the point here were discussing the axrx 5700xt 8gbd6-3dh\nand on that in my experience everybody can set aside there performance concerns and thermal concerns as long as you have good airflow to it this card will run fine\nps after running all the stess tests i dont think my cards fans were ever hitting above 60% or if they were they were just rely quiet and at idle they are off so all in all its not a load card and keep in mind in my case the gpu intake is literally less than an inch from the side vents so i rely was expecting this to be a bit louder and just to clarify i run this system backwards with the io facing me so the gpu was also facing me and still total syste noise was negligible and actually quieter than when i had the rtx 2060 super fe in here as its idle fan speed was like 40% and ramped up to 90 within 5mins of a stress test now am i disparaging nvidia here for there FE coolers NO i love that card but i put that into an even more space constrained aluminum box from aliexpress its very nice and it is a matx sff build nut that was literally the only high performance modern gpu that would fit as it has the power cables on the side and not the top were there is literly no room in between the side aluminum panel and the top of the gpu so i had to sacrifice my more expensive 2060s on that build and that is why i was looking for a replacement for this one as its an older intel platform and not my primary rig but i jumped into this fully expecting to haf to down clock this to basically a 5700 not xt specs or even a 5600 and for the price i was totaly ok with that and was actually one of the deciding factors in picking this model as it uses the reference pcb the from stock rx 5700xt so future water cooling a gpu inside this RIDICULOUSLY small case was just kind of exciting lol and still not off the table now that i find out this card runs just fine at fully stock and is very competitive with my bigger RTX 2070super FE thats what was rely surprising as i paid 499 for that and no were near that for this and ironically this card will perform way better in linux as it is native MESA vesa and will not need to leverage nvidia to volcan runtime conversions and im no levelonetechs but i know my way around linux and rely enjoy tinkering with it and this will enable some pretty good performance numbers for paired with this easly clocked to 5ghz water cooled 8700k so ya im not regretting this purchase one bit...\nbut dont misunderstand me if i find any problems with this card long term i will definitely update this review and then you as a buyer can decide if those issues are a deal breaker in the future but likely there will already be a slurry of other options out there especially once RDNA2 comes to the DIY space but for now and for a while RDNA1 is what we have available as amd is still leveraging market share from the next gen consoles which are using RDNA2 so they will likely try to enjoy the win there for a while befor putting that tech on the DIYPC market and reaffirming the PC as the performance king over any console that way they get 2 wins and quite frankly after the whole FX dry spel and the rx vega flop they kinda need the wins...\n\n...update...ok so 3 months and one debacle of a election later this card is still working perfectly and is even more stable today still using the optional rolling release drivers as opposed to the slightly older LTS drivers so ya no problembs at all...one slight complaint and it's not even a real one but a superficial one with the light weight feel of the whole card, is it is a small card and since it realy dosnt produce the kinda heat a overclocked card running at over 200watts it dosnt need anything more than a cheap light aluminum cooler stack but it still feels cheap lol ...this dosnt effect performance at all at least in this specific card as it simply dosnt need a more dence cooling solution so no real complaints just that one very first world one lol"}, {"title": "Mostly Reliable", "rating": "5", "location-date": "Reviewed in the United States on August 20, 2020", "text": "I have had this video card since May 18, 2020 and have had no major issues with it. I did have a couple of times where it did black screen on me in the middle of a gaming session, but a driver update resolved the issue and it hasn't happened again since. This card has been mostly reliable except for those couple of aforementioned cases. I mainly play Star Citizen @ 1440p and it performs great for a greatly un-optimized game. This card was an upgrade for an old R9 280X that now has a home in my HTPC/Steam Box."}, {"title": "Good graphics card, no need for higher end models", "rating": "5", "location-date": "Reviewed in the United States on February 23, 2021", "text": "Bought in December on pre-buy and got it by Christmas Eve. Installed in my niece's computer with i7-9700 (non-k, b365 mobo), and she plays anything at 144hz without issue, 1080p. Not all setting on ultra but who really notices when esport fps games? Apex Legends, fortnite, etc. I undervolted it and stock cooler with custom fan curve never goes over 75C. She streams also. Great buy at msrp, $389. Especially when you can't find decent graphics cards anywhere! Hope this helps someone."}, {"title": "Good performance with a serious drawback", "rating": "3", "location-date": "Reviewed in the United States on May 16, 2020", "text": "Installed this as an upgrade from my GT 710. The card was easy enough to install (insert into a free PCIe slot, plug the PCIe power in, install drivers as necessary) but there's one serious issue (which isn't specific to just PowerColor cards, as it affects pretty much all AIBs (which is why I give it a 3/5 stars) - the firmware and drivers are poorly written! Thanks AMD! When it works, it works great. When it doesn't, you better hope you can easily do a hard reset on your PC and that you save your work pretty darn often. If you're looking for a video card of this caliber, get any RTX 2060 Super instead as they don't have poorly written firmware."}, {"title": "A beefy graphics cards", "rating": "5", "location-date": "Reviewed in the United States on January 3, 2021", "text": "Made a right decision purchasing this card back in October when it was only $379 with many bad reviews about crashing. A fantastic price for such performance anyway so I gave it a chance. After tuning the settings and making sure it's hooked up with two separate pcie cables, it runs smoothly at 1999 Mhz 1050-1060 mV, temp stays below 75 C most of the time. Hit a solid 60fps 1440p on Cyberpunk with High/Medium custom settings"}, {"title": "Ready for Prime time...Finally", "rating": "4", "location-date": "Reviewed in the United States on December 14, 2020", "text": "Got one of these graphic cards when first released. Ran like crap. Problems with the drivers so I returned it. Now the drivers installed with no issues and the card is working well. Happy!"}, {"title": "Badass Graphics card", "rating": "5", "location-date": "Reviewed in the United States on April 1, 2020", "text": "Hello first thing I want to warn you about was I had a really hard time putting this on my motherboard and case not sure if everyone has this problem but I had to take the metal face plate on the graphics card off and then I put the graphics card in and screwed it on later I had to bend some tabs on the plate but other than that it is awesome."}, {"title": "These things rock, great power to cost ratio", "rating": "5", "location-date": "Reviewed in the United States on February 21, 2021", "text": "If you can find these for decent prices, they are super efficient cards for the price making them an ideal value choice. Tough to find anything at the moment, but these are great if you can get them near MSRP."}, {"title": "Very good", "rating": "5", "location-date": "Reviewed in the United States on November 1, 2020", "text": "Make sure when you buy this you need 650w power supply minimum I see alot of reviews saying it black screened but they most likely don't have enough power as they have upgraded from really outdated cards. It's a great card for the price but now just wait for the 6700xt"}, {"title": "Great buy for the price.", "rating": "5", "location-date": "Reviewed in the United States on January 4, 2021", "text": "I'm pretty sure the card was cheaper 6 months ago. Nevertheless, I'm glad I snagged this on preorder when I did. Video card supply is crazy at the moment. The card runs stable on everything I play, although it might be overkill for my 1080p monitor."}]}, {"label": "PNY VCQK420-2GB-PB NVIDIA VCQK420-2GB-PB Quadro K420 2GB - Exxact Corporation", "price": "109.00", "description": "NVIDIA VCQK420-2GB-PB Quadro K420 2GB - Exxact Corporation", "rating": null}]}